var ensembleData = {
  "time": "2026-10-21 21:32:32",
  "issue": "2026294",
  "code": "29,43,10,02,34,27,28",
  "zodiac": "虎,鼠,鸡,蛇,鸡,龙,兔",
  "wave": "red,green,blue,red,red,green,green",
  "teSx": "兔",
  "teWei": 8,
  "nextIssue": "2026295",
  "ninePool": [
    "牛",
    "羊",
    "蛇",
    "鼠",
    "龙",
    "猴",
    "狗",
    "鸡",
    "猪"
  ],
  "sixPool": [
    "牛",
    "羊",
    "蛇",
    "鼠",
    "龙",
    "猴"
  ],
  "five": [
    "蛇",
    "羊",
    "牛",
    "鼠",
    "龙"
  ],
  "four": [
    "蛇",
    "羊",
    "牛",
    "鼠"
  ],
  "three": [
    "蛇",
    "羊",
    "牛"
  ],
  "pools": {
    "3": [
      "蛇",
      "羊",
      "牛"
    ],
    "4": [
      "蛇",
      "羊",
      "牛",
      "鼠"
    ],
    "5": [
      "蛇",
      "羊",
      "牛",
      "鼠",
      "龙"
    ]
  },
  "optTails": [
    2,
    6,
    8,
    4,
    0,
    5,
    7
  ],
  "numbers": [
    2,
    36,
    38,
    6,
    42,
    12,
    14,
    48,
    18,
    24,
    26,
    30,
    3,
    47,
    31,
    43
  ],
  "killZodiacs": []
};