var ensembleData = {
  "time": "2026-08-27 21:32:32",
  "issue": "2026239",
  "code": "47,43,34,17,22,07,05",
  "zodiac": "猴,鼠,鸡,虎,鸡,鼠,虎",
  "wave": "blue,green,red,green,green,red,green",
  "teSx": "虎",
  "teWei": 5,
  "nextIssue": "2026240",
  "ninePool": [
    "马",
    "鸡",
    "猴",
    "龙",
    "狗",
    "兔",
    "鼠",
    "猪",
    "蛇"
  ],
  "sixPool": [
    "马",
    "鸡",
    "猴",
    "龙",
    "狗",
    "兔"
  ],
  "five": [
    "鸡",
    "马",
    "龙",
    "猴",
    "狗"
  ],
  "four": [
    "鸡",
    "马",
    "龙",
    "猴"
  ],
  "three": [
    "鸡",
    "马",
    "龙"
  ],
  "pools": {
    "3": [
      "鸡",
      "马",
      "龙"
    ],
    "4": [
      "鸡",
      "马",
      "龙",
      "猴"
    ],
    "5": [
      "鸡",
      "马",
      "龙",
      "猴",
      "狗"
    ]
  },
  "optTails": [
    3,
    5,
    7,
    9,
    0,
    2,
    4
  ],
  "numbers": [
    1,
    34,
    3,
    37,
    39,
    10,
    13,
    46,
    15,
    49,
    22,
    25,
    27,
    33,
    21,
    40
  ],
  "killZodiacs": []
};