var ensembleData = {
  "time": "2026-09-21 21:32:32",
  "issue": "2026264",
  "code": "10,06,08,31,22,24,21",
  "zodiac": "鸡,牛,猪,鼠,鸡,羊,狗",
  "wave": "blue,green,red,blue,green,red,green",
  "teSx": "狗",
  "teWei": 1,
  "nextIssue": "2026265",
  "ninePool": [
    "兔",
    "鸡",
    "鼠",
    "猪",
    "马",
    "猴",
    "虎",
    "龙",
    "蛇"
  ],
  "sixPool": [
    "兔",
    "鸡",
    "鼠",
    "猪",
    "马",
    "猴"
  ],
  "five": [
    "兔",
    "鼠",
    "鸡",
    "猪",
    "马"
  ],
  "four": [
    "兔",
    "鼠",
    "鸡",
    "猪"
  ],
  "three": [
    "兔",
    "鼠",
    "鸡"
  ],
  "pools": {
    "3": [
      "兔",
      "鼠",
      "鸡"
    ],
    "4": [
      "兔",
      "鼠",
      "鸡",
      "猪"
    ],
    "5": [
      "兔",
      "鼠",
      "鸡",
      "猪",
      "马"
    ]
  },
  "optTails": [
    4,
    6,
    0,
    8,
    7,
    9,
    1
  ],
  "numbers": [
    34,
    4,
    7,
    40,
    10,
    43,
    46,
    16,
    19,
    22,
    28,
    31,
    13,
    25,
    47,
    8
  ],
  "killZodiacs": []
};