var ensembleData = {
  "time": "2026-07-19 21:32:32",
  "issue": "2026200",
  "code": "43,46,05,32,35,29,39",
  "zodiac": "鼠,鸡,虎,猪,猴,虎,龙",
  "wave": "green,red,green,green,red,red,green",
  "teSx": "龙",
  "teWei": 9,
  "nextIssue": "2026201",
  "ninePool": [
    "兔",
    "鸡",
    "猴",
    "牛",
    "马",
    "狗",
    "鼠",
    "虎",
    "羊"
  ],
  "sixPool": [
    "兔",
    "鸡",
    "猴",
    "牛",
    "马",
    "狗"
  ],
  "five": [
    "牛",
    "兔",
    "马",
    "鸡",
    "猴"
  ],
  "four": [
    "牛",
    "兔",
    "马",
    "鸡"
  ],
  "three": [
    "牛",
    "兔",
    "马"
  ],
  "pools": {
    "3": [
      "牛",
      "兔",
      "马"
    ],
    "4": [
      "牛",
      "兔",
      "马",
      "鸡"
    ],
    "5": [
      "牛",
      "兔",
      "马",
      "鸡",
      "猴"
    ]
  },
  "optTails": [
    6,
    8,
    0,
    2,
    4,
    1,
    3
  ],
  "numbers": [
    1,
    4,
    37,
    6,
    40,
    42,
    13,
    16,
    49,
    18,
    25,
    28,
    30,
    34,
    22,
    33
  ],
  "killZodiacs": []
};