var ensembleData = {
  "time": "2026-08-16 21:32:32",
  "issue": "2026228",
  "code": "38,26,08,06,29,18,23",
  "zodiac": "蛇,蛇,猪,牛,虎,牛,猴",
  "wave": "green,blue,red,green,red,red,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026229",
  "ninePool": [
    "龙",
    "鸡",
    "马",
    "猪",
    "蛇",
    "鼠",
    "狗",
    "猴",
    "羊"
  ],
  "sixPool": [
    "龙",
    "鸡",
    "马",
    "猪",
    "蛇",
    "鼠"
  ],
  "five": [
    "鸡",
    "龙",
    "猪",
    "鼠",
    "蛇"
  ],
  "four": [
    "鸡",
    "龙",
    "猪",
    "鼠"
  ],
  "three": [
    "鸡",
    "龙",
    "猪"
  ],
  "pools": {
    "3": [
      "鸡",
      "龙",
      "猪"
    ],
    "4": [
      "鸡",
      "龙",
      "猪",
      "鼠"
    ],
    "5": [
      "鸡",
      "龙",
      "猪",
      "鼠",
      "蛇"
    ]
  },
  "optTails": [
    0,
    2,
    4,
    6,
    3,
    5,
    7
  ],
  "numbers": [
    32,
    34,
    3,
    39,
    8,
    10,
    44,
    46,
    15,
    20,
    22,
    27,
    38,
    2,
    7,
    14
  ],
  "killZodiacs": []
};