var ensembleData = {
  "time": "2026-10-22 21:32:32",
  "issue": "2026295",
  "code": "22,28,33,17,13,47,25",
  "zodiac": "鸡,兔,狗,虎,马,猴,马",
  "wave": "green,green,green,green,red,blue,blue",
  "teSx": "马",
  "teWei": 5,
  "nextIssue": "2026296",
  "ninePool": [
    "猴",
    "鸡",
    "虎",
    "龙",
    "牛",
    "猪",
    "狗",
    "鼠",
    "蛇"
  ],
  "sixPool": [
    "猴",
    "鸡",
    "虎",
    "龙",
    "牛",
    "猪"
  ],
  "five": [
    "虎",
    "龙",
    "鸡",
    "猴",
    "牛"
  ],
  "four": [
    "虎",
    "龙",
    "鸡",
    "猴"
  ],
  "three": [
    "虎",
    "龙",
    "鸡"
  ],
  "pools": {
    "3": [
      "虎",
      "龙",
      "鸡"
    ],
    "4": [
      "虎",
      "龙",
      "鸡",
      "猴"
    ],
    "5": [
      "虎",
      "龙",
      "鸡",
      "猴",
      "牛"
    ]
  },
  "optTails": [
    5,
    7,
    9,
    1,
    3,
    0,
    2
  ],
  "numbers": [
    34,
    3,
    5,
    39,
    41,
    10,
    46,
    15,
    17,
    22,
    27,
    29,
    6,
    42,
    44,
    20
  ],
  "killZodiacs": []
};