var ensembleData = {
  "time": "2026-10-13 21:32:32",
  "issue": "2026286",
  "code": "37,49,28,08,29,01,24",
  "zodiac": "马,马,兔,猪,虎,马,羊",
  "wave": "blue,green,green,red,red,red,red",
  "teSx": "羊",
  "teWei": 4,
  "nextIssue": "2026287",
  "ninePool": [
    "兔",
    "鸡",
    "虎",
    "猴",
    "狗",
    "龙",
    "牛",
    "马",
    "蛇"
  ],
  "sixPool": [
    "兔",
    "鸡",
    "虎",
    "猴",
    "狗",
    "龙"
  ],
  "five": [
    "鸡",
    "兔",
    "虎",
    "猴",
    "狗"
  ],
  "four": [
    "鸡",
    "兔",
    "虎",
    "猴"
  ],
  "three": [
    "鸡",
    "兔",
    "虎"
  ],
  "pools": {
    "3": [
      "鸡",
      "兔",
      "虎"
    ],
    "4": [
      "鸡",
      "兔",
      "虎",
      "猴"
    ],
    "5": [
      "鸡",
      "兔",
      "虎",
      "猴",
      "狗"
    ]
  },
  "optTails": [
    0,
    4,
    6,
    2,
    8,
    5,
    7
  ],
  "numbers": [
    34,
    4,
    5,
    40,
    41,
    10,
    46,
    16,
    17,
    22,
    28,
    29,
    3,
    47,
    27,
    21
  ],
  "killZodiacs": []
};