var ensembleData = {
  "time": "2026-09-17 21:32:32",
  "issue": "2026260",
  "code": "25,26,44,32,06,48,20",
  "zodiac": "马,蛇,猪,猪,牛,羊,猪",
  "wave": "blue,blue,green,green,green,blue,blue",
  "teSx": "猪",
  "teWei": 0,
  "nextIssue": "2026261",
  "ninePool": [
    "虎",
    "羊",
    "猴",
    "马",
    "牛",
    "狗",
    "兔",
    "鼠",
    "猪"
  ],
  "sixPool": [
    "虎",
    "羊",
    "猴",
    "马",
    "牛",
    "狗"
  ],
  "five": [
    "虎",
    "猴",
    "牛",
    "马",
    "羊"
  ],
  "four": [
    "虎",
    "猴",
    "牛",
    "马"
  ],
  "three": [
    "虎",
    "猴",
    "牛"
  ],
  "pools": {
    "3": [
      "虎",
      "猴",
      "牛"
    ],
    "4": [
      "虎",
      "猴",
      "牛",
      "马"
    ],
    "5": [
      "虎",
      "猴",
      "牛",
      "马",
      "羊"
    ]
  },
  "optTails": [
    5,
    7,
    1,
    9,
    3,
    6,
    8
  ],
  "numbers": [
    35,
    5,
    6,
    41,
    42,
    11,
    47,
    17,
    18,
    23,
    29,
    30,
    33,
    13,
    24,
    37
  ],
  "killZodiacs": []
};