var ensembleData = {
  "time": "2026-08-17 21:32:32",
  "issue": "2026229",
  "code": "11,07,15,13,33,16,38",
  "zodiac": "猴,鼠,龙,马,狗,兔,蛇",
  "wave": "green,red,blue,red,green,green,green",
  "teSx": "蛇",
  "teWei": 8,
  "nextIssue": "2026230",
  "ninePool": [
    "鸡",
    "猪",
    "牛",
    "羊",
    "鼠",
    "龙",
    "虎",
    "猴",
    "兔"
  ],
  "sixPool": [
    "鸡",
    "猪",
    "牛",
    "羊",
    "鼠",
    "龙"
  ],
  "five": [
    "羊",
    "鸡",
    "龙",
    "猪",
    "牛"
  ],
  "four": [
    "羊",
    "鸡",
    "龙",
    "猪"
  ],
  "three": [
    "羊",
    "鸡",
    "龙"
  ],
  "pools": {
    "3": [
      "羊",
      "鸡",
      "龙"
    ],
    "4": [
      "羊",
      "鸡",
      "龙",
      "猪"
    ],
    "5": [
      "羊",
      "鸡",
      "龙",
      "猪",
      "牛"
    ]
  },
  "optTails": [
    2,
    4,
    6,
    8,
    0,
    3,
    5
  ],
  "numbers": [
    34,
    3,
    36,
    39,
    10,
    12,
    46,
    15,
    48,
    22,
    24,
    27,
    20,
    30,
    44,
    7
  ],
  "killZodiacs": []
};