var ensembleData = {
  "time": "2026-08-30 21:32:32",
  "issue": "2026242",
  "code": "29,35,46,32,13,31,09",
  "zodiac": "虎,猴,鸡,猪,马,鼠,狗",
  "wave": "red,red,red,green,red,blue,blue",
  "teSx": "狗",
  "teWei": 9,
  "nextIssue": "2026243",
  "ninePool": [
    "猴",
    "鸡",
    "兔",
    "鼠",
    "羊",
    "虎",
    "马",
    "龙",
    "狗"
  ],
  "sixPool": [
    "猴",
    "鸡",
    "兔",
    "鼠",
    "羊",
    "虎"
  ],
  "five": [
    "猴",
    "兔",
    "羊",
    "鸡",
    "鼠"
  ],
  "four": [
    "猴",
    "兔",
    "羊",
    "鸡"
  ],
  "three": [
    "猴",
    "兔",
    "羊"
  ],
  "pools": {
    "3": [
      "猴",
      "兔",
      "羊"
    ],
    "4": [
      "猴",
      "兔",
      "羊",
      "鸡"
    ],
    "5": [
      "猴",
      "兔",
      "羊",
      "鸡",
      "鼠"
    ]
  },
  "optTails": [
    4,
    6,
    8,
    1,
    3,
    5,
    7
  ],
  "numbers": [
    35,
    4,
    36,
    40,
    11,
    12,
    47,
    16,
    48,
    23,
    24,
    28,
    34,
    46,
    41,
    31
  ],
  "killZodiacs": []
};