var ensembleData = {
  "time": "2026-10-01 21:32:32",
  "issue": "2026274",
  "code": "12,16,32,05,39,36,33",
  "zodiac": "羊,兔,猪,虎,龙,羊,狗",
  "wave": "red,green,green,green,green,blue,green",
  "teSx": "狗",
  "teWei": 3,
  "nextIssue": "2026275",
  "ninePool": [
    "羊",
    "蛇",
    "龙",
    "鸡",
    "猪",
    "鼠",
    "马",
    "猴",
    "牛"
  ],
  "sixPool": [
    "羊",
    "蛇",
    "龙",
    "鸡",
    "猪",
    "鼠"
  ],
  "five": [
    "蛇",
    "羊",
    "龙",
    "鸡",
    "猪"
  ],
  "four": [
    "蛇",
    "羊",
    "龙",
    "鸡"
  ],
  "three": [
    "蛇",
    "羊",
    "龙"
  ],
  "pools": {
    "3": [
      "蛇",
      "羊",
      "龙"
    ],
    "4": [
      "蛇",
      "羊",
      "龙",
      "鸡"
    ],
    "5": [
      "蛇",
      "羊",
      "龙",
      "鸡",
      "猪"
    ]
  },
  "optTails": [
    2,
    4,
    6,
    8,
    3,
    5,
    7
  ],
  "numbers": [
    2,
    3,
    36,
    38,
    39,
    12,
    14,
    15,
    48,
    24,
    26,
    27,
    34,
    10,
    31,
    43
  ],
  "killZodiacs": []
};