var ensembleData = {
  "time": "2026-10-12 21:32:32",
  "issue": "2026285",
  "code": "46,45,43,39,20,40,19",
  "zodiac": "鸡,狗,鼠,龙,猪,兔,鼠",
  "wave": "red,red,green,green,blue,red,red",
  "teSx": "鼠",
  "teWei": 9,
  "nextIssue": "2026286",
  "ninePool": [
    "虎",
    "兔",
    "马",
    "猴",
    "狗",
    "龙",
    "蛇",
    "牛",
    "鸡"
  ],
  "sixPool": [
    "虎",
    "兔",
    "马",
    "猴",
    "狗",
    "龙"
  ],
  "five": [
    "兔",
    "虎",
    "猴",
    "龙",
    "马"
  ],
  "four": [
    "兔",
    "虎",
    "猴",
    "龙"
  ],
  "three": [
    "兔",
    "虎",
    "猴"
  ],
  "pools": {
    "3": [
      "兔",
      "虎",
      "猴"
    ],
    "4": [
      "兔",
      "虎",
      "猴",
      "龙"
    ],
    "5": [
      "兔",
      "虎",
      "猴",
      "龙",
      "马"
    ]
  },
  "optTails": [
    5,
    7,
    1,
    4,
    6,
    8,
    0
  ],
  "numbers": [
    35,
    4,
    5,
    40,
    41,
    11,
    47,
    16,
    17,
    23,
    28,
    29,
    13,
    45,
    25,
    3
  ],
  "killZodiacs": []
};