var ensembleData = {
  "time": "2026-10-11 21:32:32",
  "issue": "2026284",
  "code": "04,35,22,48,03,18,32",
  "zodiac": "兔,猴,鸡,羊,龙,牛,猪",
  "wave": "blue,red,green,blue,blue,red,green",
  "teSx": "猪",
  "teWei": 2,
  "nextIssue": "2026285",
  "ninePool": [
    "羊",
    "兔",
    "马",
    "鼠",
    "狗",
    "虎",
    "蛇",
    "牛",
    "猴"
  ],
  "sixPool": [
    "羊",
    "兔",
    "马",
    "鼠",
    "狗",
    "虎"
  ],
  "five": [
    "兔",
    "羊",
    "马",
    "鼠",
    "狗"
  ],
  "four": [
    "兔",
    "羊",
    "马",
    "鼠"
  ],
  "three": [
    "兔",
    "羊",
    "马"
  ],
  "pools": {
    "3": [
      "兔",
      "羊",
      "马"
    ],
    "4": [
      "兔",
      "羊",
      "马",
      "鼠"
    ],
    "5": [
      "兔",
      "羊",
      "马",
      "鼠",
      "狗"
    ]
  },
  "optTails": [
    4,
    6,
    8,
    0,
    2,
    1,
    3
  ],
  "numbers": [
    1,
    4,
    36,
    37,
    40,
    12,
    13,
    16,
    48,
    49,
    24,
    25,
    28,
    45,
    41,
    29
  ],
  "killZodiacs": []
};