var ensembleData = {
  "time": "2026-08-14 21:32:32",
  "issue": "2026226",
  "code": "01,11,29,38,04,33,17",
  "zodiac": "马,猴,虎,蛇,兔,狗,虎",
  "wave": "red,green,red,green,blue,green,green",
  "teSx": "虎",
  "teWei": 7,
  "nextIssue": "2026227",
  "ninePool": [
    "鸡",
    "龙",
    "马",
    "猴",
    "狗",
    "鼠",
    "兔",
    "羊",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "龙",
    "马",
    "猴",
    "狗",
    "鼠"
  ],
  "five": [
    "鸡",
    "马",
    "龙",
    "猴",
    "狗"
  ],
  "four": [
    "鸡",
    "马",
    "龙",
    "猴"
  ],
  "three": [
    "鸡",
    "马",
    "龙"
  ],
  "pools": {
    "3": [
      "鸡",
      "马",
      "龙"
    ],
    "4": [
      "鸡",
      "马",
      "龙",
      "猴"
    ],
    "5": [
      "鸡",
      "马",
      "龙",
      "猴",
      "狗"
    ]
  },
  "optTails": [
    3,
    5,
    7,
    9,
    0,
    2,
    4
  ],
  "numbers": [
    1,
    34,
    3,
    37,
    39,
    10,
    13,
    46,
    15,
    49,
    22,
    25,
    27,
    11,
    45,
    21
  ],
  "killZodiacs": []
};