var ensembleData = {
  "time": "2026-10-20 21:32:32",
  "issue": "2026293",
  "code": "38,10,48,49,13,09,05",
  "zodiac": "蛇,鸡,羊,马,马,狗,虎",
  "wave": "green,blue,blue,green,red,blue,green",
  "teSx": "虎",
  "teWei": 5,
  "nextIssue": "2026294",
  "ninePool": [
    "狗",
    "龙",
    "羊",
    "鼠",
    "猪",
    "牛",
    "猴",
    "虎",
    "鸡"
  ],
  "sixPool": [
    "狗",
    "龙",
    "羊",
    "鼠",
    "猪",
    "牛"
  ],
  "five": [
    "狗",
    "龙",
    "羊",
    "牛",
    "鼠"
  ],
  "four": [
    "狗",
    "龙",
    "羊",
    "牛"
  ],
  "three": [
    "狗",
    "龙",
    "羊"
  ],
  "pools": {
    "3": [
      "狗",
      "龙",
      "羊"
    ],
    "4": [
      "狗",
      "龙",
      "羊",
      "牛"
    ],
    "5": [
      "狗",
      "龙",
      "羊",
      "牛",
      "鼠"
    ]
  },
  "optTails": [
    9,
    3,
    5,
    1,
    7,
    2,
    4
  ],
  "numbers": [
    33,
    3,
    36,
    39,
    9,
    12,
    45,
    15,
    48,
    21,
    24,
    27,
    6,
    43,
    42,
    44
  ],
  "killZodiacs": []
};