var ensembleData = {
  "time": "2026-08-02 21:32:32",
  "issue": "2026214",
  "code": "29,30,27,38,43,31,04",
  "zodiac": "虎,牛,龙,蛇,鼠,鼠,兔",
  "wave": "red,red,green,green,green,blue,blue",
  "teSx": "兔",
  "teWei": 4,
  "nextIssue": "2026215",
  "ninePool": [
    "羊",
    "鸡",
    "猴",
    "牛",
    "鼠",
    "马",
    "龙",
    "猪",
    "蛇"
  ],
  "sixPool": [
    "羊",
    "鸡",
    "猴",
    "牛",
    "鼠",
    "马"
  ],
  "five": [
    "猴",
    "鸡",
    "羊",
    "牛",
    "鼠"
  ],
  "four": [
    "猴",
    "鸡",
    "羊",
    "牛"
  ],
  "three": [
    "猴",
    "鸡",
    "羊"
  ],
  "pools": {
    "3": [
      "猴",
      "鸡",
      "羊"
    ],
    "4": [
      "猴",
      "鸡",
      "羊",
      "牛"
    ],
    "5": [
      "猴",
      "鸡",
      "羊",
      "牛",
      "鼠"
    ]
  },
  "optTails": [
    2,
    4,
    6,
    1,
    3,
    5,
    7
  ],
  "numbers": [
    34,
    35,
    36,
    10,
    11,
    12,
    46,
    47,
    48,
    22,
    23,
    24,
    30,
    43,
    13,
    37
  ],
  "killZodiacs": []
};