var ensembleData = {
  "time": "2026-08-25 21:32:32",
  "issue": "2026237",
  "code": "47,36,14,06,41,25,12",
  "zodiac": "猴,羊,蛇,牛,虎,马,羊",
  "wave": "blue,blue,blue,green,blue,blue,red",
  "teSx": "羊",
  "teWei": 2,
  "nextIssue": "2026238",
  "ninePool": [
    "鸡",
    "蛇",
    "兔",
    "鼠",
    "狗",
    "羊",
    "猪",
    "牛",
    "马"
  ],
  "sixPool": [
    "鸡",
    "蛇",
    "兔",
    "鼠",
    "狗",
    "羊"
  ],
  "five": [
    "鸡",
    "蛇",
    "兔",
    "鼠",
    "狗"
  ],
  "four": [
    "鸡",
    "蛇",
    "兔",
    "鼠"
  ],
  "three": [
    "鸡",
    "蛇",
    "兔"
  ],
  "pools": {
    "3": [
      "鸡",
      "蛇",
      "兔"
    ],
    "4": [
      "鸡",
      "蛇",
      "兔",
      "鼠"
    ],
    "5": [
      "鸡",
      "蛇",
      "兔",
      "鼠",
      "狗"
    ]
  },
  "optTails": [
    4,
    6,
    0,
    2,
    8,
    1,
    7
  ],
  "numbers": [
    2,
    34,
    4,
    38,
    40,
    10,
    46,
    14,
    16,
    22,
    26,
    28,
    33,
    21,
    24,
    36
  ],
  "killZodiacs": []
};