var ensembleData = {
  "time": "2026-10-30 21:32:32",
  "issue": "2026303",
  "code": "08,28,40,03,38,49,17",
  "zodiac": "猪,兔,兔,龙,蛇,马,虎",
  "wave": "red,green,red,blue,green,green,green",
  "teSx": "虎",
  "teWei": 7,
  "nextIssue": "2026304",
  "ninePool": [
    "鸡",
    "羊",
    "猴",
    "牛",
    "兔",
    "狗",
    "猪",
    "蛇",
    "马"
  ],
  "sixPool": [
    "鸡",
    "羊",
    "猴",
    "牛",
    "兔",
    "狗"
  ],
  "five": [
    "羊",
    "鸡",
    "猴",
    "兔",
    "牛"
  ],
  "four": [
    "羊",
    "鸡",
    "猴",
    "兔"
  ],
  "three": [
    "羊",
    "鸡",
    "猴"
  ],
  "pools": {
    "3": [
      "羊",
      "鸡",
      "猴"
    ],
    "4": [
      "羊",
      "鸡",
      "猴",
      "兔"
    ],
    "5": [
      "羊",
      "鸡",
      "猴",
      "兔",
      "牛"
    ]
  },
  "optTails": [
    2,
    4,
    6,
    8,
    0,
    1,
    3
  ],
  "numbers": [
    34,
    35,
    36,
    10,
    11,
    12,
    46,
    47,
    48,
    22,
    23,
    24,
    6,
    4,
    42,
    16
  ],
  "killZodiacs": []
};