var ensembleData = {
  "time": "2026-09-30 21:32:32",
  "issue": "2026273",
  "code": "30,03,25,28,06,17,05",
  "zodiac": "牛,龙,马,兔,牛,虎,虎",
  "wave": "red,blue,blue,green,green,green,green",
  "teSx": "虎",
  "teWei": 5,
  "nextIssue": "2026274",
  "ninePool": [
    "马",
    "鸡",
    "龙",
    "猪",
    "蛇",
    "兔",
    "羊",
    "牛",
    "鼠"
  ],
  "sixPool": [
    "马",
    "鸡",
    "龙",
    "猪",
    "蛇",
    "兔"
  ],
  "five": [
    "猪",
    "鸡",
    "马",
    "兔",
    "龙"
  ],
  "four": [
    "猪",
    "鸡",
    "马",
    "兔"
  ],
  "three": [
    "猪",
    "鸡",
    "马"
  ],
  "pools": {
    "3": [
      "猪",
      "鸡",
      "马"
    ],
    "4": [
      "猪",
      "鸡",
      "马",
      "兔"
    ],
    "5": [
      "猪",
      "鸡",
      "马",
      "兔",
      "龙"
    ]
  },
  "optTails": [
    0,
    2,
    4,
    8,
    6,
    1,
    3
  ],
  "numbers": [
    32,
    1,
    34,
    37,
    8,
    10,
    44,
    13,
    46,
    49,
    20,
    22,
    25,
    3,
    4,
    26
  ],
  "killZodiacs": []
};