var ensembleData = {
  "time": "2026-08-22 21:32:32",
  "issue": "2026234",
  "code": "25,30,37,19,07,17,39",
  "zodiac": "马,牛,马,鼠,鼠,虎,龙",
  "wave": "blue,red,blue,red,red,green,green",
  "teSx": "龙",
  "teWei": 9,
  "nextIssue": "2026235",
  "ninePool": [
    "鸡",
    "鼠",
    "马",
    "蛇",
    "羊",
    "牛",
    "狗",
    "兔",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "鼠",
    "马",
    "蛇",
    "羊",
    "牛"
  ],
  "five": [
    "鸡",
    "蛇",
    "鼠",
    "马",
    "牛"
  ],
  "four": [
    "鸡",
    "蛇",
    "鼠",
    "马"
  ],
  "three": [
    "鸡",
    "蛇",
    "鼠"
  ],
  "pools": {
    "3": [
      "鸡",
      "蛇",
      "鼠"
    ],
    "4": [
      "鸡",
      "蛇",
      "鼠",
      "马"
    ],
    "5": [
      "鸡",
      "蛇",
      "鼠",
      "马",
      "牛"
    ]
  },
  "optTails": [
    2,
    4,
    6,
    0,
    8,
    7,
    9
  ],
  "numbers": [
    2,
    34,
    38,
    7,
    10,
    43,
    46,
    14,
    19,
    22,
    26,
    31,
    30,
    13,
    18,
    25
  ],
  "killZodiacs": []
};