var ensembleData = {
  "time": "2026-07-30 21:32:32",
  "issue": "2026211",
  "code": "13,12,39,37,38,08,01",
  "zodiac": "马,羊,龙,马,蛇,猪,马",
  "wave": "red,red,green,blue,green,red,red",
  "teSx": "马",
  "teWei": 1,
  "nextIssue": "2026212",
  "ninePool": [
    "狗",
    "牛",
    "鸡",
    "猴",
    "鼠",
    "羊",
    "猪",
    "蛇",
    "龙"
  ],
  "sixPool": [
    "狗",
    "牛",
    "鼠",
    "鸡",
    "猴",
    "羊"
  ],
  "five": [
    "猴",
    "狗",
    "鼠",
    "牛",
    "羊"
  ],
  "four": [
    "猴",
    "狗",
    "鼠",
    "牛"
  ],
  "three": [
    "猴",
    "狗",
    "鼠"
  ],
  "pools": {
    "3": [
      "猴",
      "狗",
      "鼠"
    ],
    "4": [
      "猴",
      "狗",
      "鼠",
      "牛"
    ],
    "5": [
      "猴",
      "狗",
      "鼠",
      "牛",
      "羊"
    ]
  },
  "optTails": [
    1,
    3,
    5,
    7,
    9,
    8,
    0
  ],
  "numbers": [
    33,
    35,
    7,
    9,
    11,
    43,
    45,
    47,
    19,
    21,
    23,
    31,
    34,
    12,
    22,
    46
  ],
  "killZodiacs": []
};