var ensembleData = {
  "time": "2026-10-06 21:32:32",
  "issue": "2026279",
  "code": "29,32,47,38,06,26,10",
  "zodiac": "虎,猪,猴,蛇,牛,蛇,鸡",
  "wave": "red,green,blue,green,green,blue,blue",
  "teSx": "鸡",
  "teWei": 0,
  "nextIssue": "2026280",
  "ninePool": [
    "羊",
    "马",
    "虎",
    "兔",
    "猪",
    "龙",
    "猴",
    "牛",
    "鸡"
  ],
  "sixPool": [
    "羊",
    "马",
    "虎",
    "兔",
    "猪",
    "龙"
  ],
  "five": [
    "虎",
    "羊",
    "马",
    "猪",
    "兔"
  ],
  "four": [
    "虎",
    "羊",
    "马",
    "猪"
  ],
  "three": [
    "虎",
    "羊",
    "马"
  ],
  "pools": {
    "3": [
      "虎",
      "羊",
      "马"
    ],
    "4": [
      "虎",
      "羊",
      "马",
      "猪"
    ],
    "5": [
      "虎",
      "羊",
      "马",
      "猪",
      "兔"
    ]
  },
  "optTails": [
    5,
    7,
    9,
    1,
    2,
    4,
    6
  ],
  "numbers": [
    1,
    36,
    5,
    37,
    41,
    12,
    13,
    48,
    17,
    49,
    24,
    25,
    29,
    28,
    3,
    4
  ],
  "killZodiacs": []
};