var ensembleData = {
  "time": "2026-08-24 21:32:32",
  "issue": "2026236",
  "code": "26,35,42,09,14,17,11",
  "zodiac": "蛇,猴,牛,狗,蛇,虎,猴",
  "wave": "blue,red,blue,blue,blue,green,green",
  "teSx": "猴",
  "teWei": 1,
  "nextIssue": "2026237",
  "ninePool": [
    "马",
    "鸡",
    "狗",
    "蛇",
    "鼠",
    "猪",
    "虎",
    "羊",
    "猴"
  ],
  "sixPool": [
    "马",
    "鸡",
    "狗",
    "蛇",
    "鼠",
    "猪"
  ],
  "five": [
    "鸡",
    "狗",
    "马",
    "蛇",
    "鼠"
  ],
  "four": [
    "鸡",
    "狗",
    "马",
    "蛇"
  ],
  "three": [
    "鸡",
    "狗",
    "马"
  ],
  "pools": {
    "3": [
      "鸡",
      "狗",
      "马"
    ],
    "4": [
      "鸡",
      "狗",
      "马",
      "蛇"
    ],
    "5": [
      "鸡",
      "狗",
      "马",
      "蛇",
      "鼠"
    ]
  },
  "optTails": [
    9,
    1,
    3,
    5,
    0,
    2,
    4
  ],
  "numbers": [
    33,
    34,
    1,
    37,
    9,
    10,
    45,
    46,
    13,
    49,
    21,
    22,
    25,
    44,
    31,
    8
  ],
  "killZodiacs": []
};