var ensembleData = {
  "time": "2026-09-09 21:32:32",
  "issue": "2026252",
  "code": "33,41,43,13,06,48,22",
  "zodiac": "狗,虎,鼠,马,牛,羊,鸡",
  "wave": "green,blue,green,red,green,blue,green",
  "teSx": "鸡",
  "teWei": 2,
  "nextIssue": "2026253",
  "ninePool": [
    "兔",
    "羊",
    "虎",
    "猴",
    "牛",
    "狗",
    "鼠",
    "蛇",
    "龙"
  ],
  "sixPool": [
    "兔",
    "羊",
    "虎",
    "猴",
    "牛",
    "狗"
  ],
  "five": [
    "兔",
    "羊",
    "虎",
    "狗",
    "猴"
  ],
  "four": [
    "兔",
    "羊",
    "虎",
    "狗"
  ],
  "three": [
    "兔",
    "羊",
    "虎"
  ],
  "pools": {
    "3": [
      "兔",
      "羊",
      "虎"
    ],
    "4": [
      "兔",
      "羊",
      "虎",
      "狗"
    ],
    "5": [
      "兔",
      "羊",
      "虎",
      "狗",
      "猴"
    ]
  },
  "optTails": [
    4,
    6,
    8,
    0,
    2,
    5,
    7
  ],
  "numbers": [
    4,
    36,
    5,
    40,
    41,
    12,
    16,
    48,
    17,
    24,
    28,
    29,
    45,
    47,
    35,
    11
  ],
  "killZodiacs": []
};