var ensembleData = {
  "time": "2026-10-29 21:32:32",
  "issue": "2026302",
  "code": "10,02,14,13,11,12,45",
  "zodiac": "鸡,蛇,蛇,马,猴,羊,狗",
  "wave": "blue,red,blue,red,green,red,red",
  "teSx": "狗",
  "teWei": 5,
  "nextIssue": "2026303",
  "ninePool": [
    "鼠",
    "鸡",
    "马",
    "猪",
    "猴",
    "兔",
    "羊",
    "龙",
    "虎"
  ],
  "sixPool": [
    "鼠",
    "鸡",
    "猪",
    "马",
    "猴",
    "兔"
  ],
  "five": [
    "鼠",
    "猪",
    "鸡",
    "兔",
    "马"
  ],
  "four": [
    "鼠",
    "猪",
    "鸡",
    "兔"
  ],
  "three": [
    "鼠",
    "猪",
    "鸡"
  ],
  "pools": {
    "3": [
      "鼠",
      "猪",
      "鸡"
    ],
    "4": [
      "鼠",
      "猪",
      "鸡",
      "兔"
    ],
    "5": [
      "鼠",
      "猪",
      "鸡",
      "兔",
      "马"
    ]
  },
  "optTails": [
    0,
    2,
    4,
    7,
    9,
    1,
    3
  ],
  "numbers": [
    32,
    34,
    7,
    8,
    10,
    43,
    44,
    46,
    19,
    20,
    22,
    31,
    47,
    4,
    37,
    16
  ],
  "killZodiacs": []
};