var ensembleData = {
  "time": "2026-10-15 21:32:32",
  "issue": "2026288",
  "code": "14,48,05,17,46,21,25",
  "zodiac": "蛇,羊,虎,虎,鸡,狗,马",
  "wave": "blue,blue,green,green,red,green,blue",
  "teSx": "马",
  "teWei": 5,
  "nextIssue": "2026289",
  "ninePool": [
    "鼠",
    "狗",
    "猴",
    "虎",
    "羊",
    "鸡",
    "牛",
    "猪",
    "兔"
  ],
  "sixPool": [
    "鼠",
    "狗",
    "猴",
    "虎",
    "羊",
    "鸡"
  ],
  "five": [
    "猴",
    "鼠",
    "狗",
    "虎",
    "羊"
  ],
  "four": [
    "猴",
    "鼠",
    "狗",
    "虎"
  ],
  "three": [
    "猴",
    "鼠",
    "狗"
  ],
  "pools": {
    "3": [
      "猴",
      "鼠",
      "狗"
    ],
    "4": [
      "猴",
      "鼠",
      "狗",
      "虎"
    ],
    "5": [
      "猴",
      "鼠",
      "狗",
      "虎",
      "羊"
    ]
  },
  "optTails": [
    1,
    3,
    5,
    7,
    9,
    2,
    4
  ],
  "numbers": [
    33,
    35,
    7,
    9,
    11,
    43,
    45,
    47,
    19,
    21,
    23,
    31,
    34,
    41,
    36,
    12
  ],
  "killZodiacs": []
};