var ensembleData = {
  "time": "2026-10-05 21:32:32",
  "issue": "2026278",
  "code": "06,40,24,29,44,01,02",
  "zodiac": "牛,兔,羊,虎,猪,马,蛇",
  "wave": "green,red,red,red,green,red,red",
  "teSx": "蛇",
  "teWei": 2,
  "nextIssue": "2026279",
  "ninePool": [
    "龙",
    "羊",
    "牛",
    "虎",
    "马",
    "猪",
    "猴",
    "兔",
    "鸡"
  ],
  "sixPool": [
    "羊",
    "龙",
    "牛",
    "虎",
    "马",
    "猪"
  ],
  "five": [
    "羊",
    "龙",
    "牛",
    "虎",
    "马"
  ],
  "four": [
    "羊",
    "龙",
    "牛",
    "虎"
  ],
  "three": [
    "羊",
    "龙",
    "牛"
  ],
  "pools": {
    "3": [
      "羊",
      "龙",
      "牛"
    ],
    "4": [
      "羊",
      "龙",
      "牛",
      "虎"
    ],
    "5": [
      "羊",
      "龙",
      "牛",
      "虎",
      "马"
    ]
  },
  "optTails": [
    2,
    6,
    8,
    4,
    3,
    5,
    7
  ],
  "numbers": [
    3,
    36,
    6,
    39,
    42,
    12,
    15,
    48,
    18,
    24,
    27,
    30,
    13,
    41,
    44,
    1
  ],
  "killZodiacs": []
};