var ensembleData = {
  "time": "2026-09-16 21:32:32",
  "issue": "2026259",
  "code": "43,33,49,36,19,30,22",
  "zodiac": "鼠,狗,马,羊,鼠,牛,鸡",
  "wave": "green,green,green,blue,red,red,green",
  "teSx": "鸡",
  "teWei": 2,
  "nextIssue": "2026260",
  "ninePool": [
    "龙",
    "羊",
    "牛",
    "兔",
    "蛇",
    "狗",
    "猴",
    "虎",
    "猪"
  ],
  "sixPool": [
    "龙",
    "羊",
    "牛",
    "兔",
    "蛇",
    "狗"
  ],
  "five": [
    "龙",
    "牛",
    "兔",
    "狗",
    "羊"
  ],
  "four": [
    "龙",
    "牛",
    "兔",
    "狗"
  ],
  "three": [
    "龙",
    "牛",
    "兔"
  ],
  "pools": {
    "3": [
      "龙",
      "牛",
      "兔"
    ],
    "4": [
      "龙",
      "牛",
      "兔",
      "狗"
    ],
    "5": [
      "龙",
      "牛",
      "兔",
      "狗",
      "羊"
    ]
  },
  "optTails": [
    6,
    8,
    0,
    3,
    5,
    7,
    9
  ],
  "numbers": [
    3,
    4,
    6,
    39,
    40,
    42,
    15,
    16,
    18,
    27,
    28,
    30,
    33,
    45,
    21,
    36
  ],
  "killZodiacs": []
};