var ensembleData = {
  "time": "2026-09-19 21:32:32",
  "issue": "2026262",
  "code": "38,22,33,47,36,07,30",
  "zodiac": "蛇,鸡,狗,猴,羊,鼠,牛",
  "wave": "green,green,green,blue,blue,red,red",
  "teSx": "牛",
  "teWei": 0,
  "nextIssue": "2026263",
  "ninePool": [
    "羊",
    "虎",
    "猴",
    "鸡",
    "鼠",
    "牛",
    "龙",
    "狗",
    "蛇"
  ],
  "sixPool": [
    "羊",
    "虎",
    "猴",
    "鸡",
    "鼠",
    "牛"
  ],
  "five": [
    "虎",
    "羊",
    "猴",
    "鼠",
    "鸡"
  ],
  "four": [
    "虎",
    "羊",
    "猴",
    "鼠"
  ],
  "three": [
    "虎",
    "羊",
    "猴"
  ],
  "pools": {
    "3": [
      "虎",
      "羊",
      "猴"
    ],
    "4": [
      "虎",
      "羊",
      "猴",
      "鼠"
    ],
    "5": [
      "虎",
      "羊",
      "猴",
      "鼠",
      "鸡"
    ]
  },
  "optTails": [
    5,
    7,
    1,
    9,
    2,
    4,
    6
  ],
  "numbers": [
    35,
    36,
    5,
    41,
    11,
    12,
    47,
    48,
    17,
    23,
    24,
    29,
    10,
    19,
    43,
    18
  ],
  "killZodiacs": []
};