var ensembleData = {
  "time": "2026-10-23 21:32:32",
  "issue": "2026296",
  "code": "14,43,26,45,03,31,23",
  "zodiac": "蛇,鼠,蛇,狗,龙,鼠,猴",
  "wave": "blue,green,blue,red,blue,blue,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026297",
  "ninePool": [
    "鼠",
    "狗",
    "龙",
    "鸡",
    "羊",
    "马",
    "猪",
    "蛇",
    "猴"
  ],
  "sixPool": [
    "鼠",
    "狗",
    "龙",
    "鸡",
    "羊",
    "马"
  ],
  "five": [
    "龙",
    "鼠",
    "羊",
    "狗",
    "鸡"
  ],
  "four": [
    "龙",
    "鼠",
    "羊",
    "狗"
  ],
  "three": [
    "龙",
    "鼠",
    "羊"
  ],
  "pools": {
    "3": [
      "龙",
      "鼠",
      "羊"
    ],
    "4": [
      "龙",
      "鼠",
      "羊",
      "狗"
    ],
    "5": [
      "龙",
      "鼠",
      "羊",
      "狗",
      "鸡"
    ]
  },
  "optTails": [
    3,
    7,
    9,
    5,
    1,
    2,
    4
  ],
  "numbers": [
    3,
    36,
    7,
    39,
    43,
    12,
    15,
    48,
    19,
    24,
    27,
    31,
    34,
    13,
    1,
    46
  ],
  "killZodiacs": []
};