var ensembleData = {
  "time": "2026-08-29 21:32:32",
  "issue": "2026241",
  "code": "29,45,27,21,42,41,49",
  "zodiac": "虎,狗,龙,狗,牛,虎,马",
  "wave": "red,red,green,green,blue,blue,green",
  "teSx": "马",
  "teWei": 9,
  "nextIssue": "2026242",
  "ninePool": [
    "鸡",
    "兔",
    "猴",
    "虎",
    "鼠",
    "龙",
    "狗",
    "猪",
    "马"
  ],
  "sixPool": [
    "鸡",
    "兔",
    "猴",
    "虎",
    "鼠",
    "龙"
  ],
  "five": [
    "兔",
    "鼠",
    "猴",
    "鸡",
    "虎"
  ],
  "four": [
    "兔",
    "鼠",
    "猴",
    "鸡"
  ],
  "three": [
    "兔",
    "鼠",
    "猴"
  ],
  "pools": {
    "3": [
      "兔",
      "鼠",
      "猴"
    ],
    "4": [
      "兔",
      "鼠",
      "猴",
      "鸡"
    ],
    "5": [
      "兔",
      "鼠",
      "猴",
      "鸡",
      "虎"
    ]
  },
  "optTails": [
    7,
    1,
    3,
    4,
    6,
    8,
    0
  ],
  "numbers": [
    35,
    4,
    7,
    40,
    43,
    11,
    47,
    16,
    19,
    23,
    28,
    31,
    46,
    10,
    41,
    15
  ],
  "killZodiacs": []
};