var ensembleData = {
  "time": "2026-09-10 21:32:32",
  "issue": "2026253",
  "code": "05,35,15,28,13,49,16",
  "zodiac": "虎,猴,龙,兔,马,马,兔",
  "wave": "green,red,blue,green,red,green,green",
  "teSx": "兔",
  "teWei": 6,
  "nextIssue": "2026254",
  "ninePool": [
    "羊",
    "虎",
    "牛",
    "马",
    "鼠",
    "猴",
    "蛇",
    "龙",
    "兔"
  ],
  "sixPool": [
    "羊",
    "虎",
    "牛",
    "马",
    "鼠",
    "猴"
  ],
  "five": [
    "羊",
    "虎",
    "牛",
    "鼠",
    "马"
  ],
  "four": [
    "羊",
    "虎",
    "牛",
    "鼠"
  ],
  "three": [
    "羊",
    "虎",
    "牛"
  ],
  "pools": {
    "3": [
      "羊",
      "虎",
      "牛"
    ],
    "4": [
      "羊",
      "虎",
      "牛",
      "鼠"
    ],
    "5": [
      "羊",
      "虎",
      "牛",
      "鼠",
      "马"
    ]
  },
  "optTails": [
    2,
    6,
    8,
    4,
    5,
    7,
    9
  ],
  "numbers": [
    36,
    5,
    6,
    41,
    42,
    12,
    48,
    17,
    18,
    24,
    29,
    30,
    25,
    31,
    19,
    35
  ],
  "killZodiacs": []
};