var ensembleData = {
  "time": "2026-10-27 21:32:32",
  "issue": "2026300",
  "code": "01,29,23,17,18,42,38",
  "zodiac": "马,虎,猴,虎,牛,牛,蛇",
  "wave": "red,red,red,green,red,blue,green",
  "teSx": "蛇",
  "teWei": 8,
  "nextIssue": "2026301",
  "ninePool": [
    "羊",
    "狗",
    "鸡",
    "猴",
    "兔",
    "牛",
    "虎",
    "猪",
    "龙"
  ],
  "sixPool": [
    "羊",
    "狗",
    "鸡",
    "猴",
    "兔",
    "牛"
  ],
  "five": [
    "狗",
    "羊",
    "猴",
    "鸡",
    "兔"
  ],
  "four": [
    "狗",
    "羊",
    "猴",
    "鸡"
  ],
  "three": [
    "狗",
    "羊",
    "猴"
  ],
  "pools": {
    "3": [
      "狗",
      "羊",
      "猴"
    ],
    "4": [
      "狗",
      "羊",
      "猴",
      "鸡"
    ],
    "5": [
      "狗",
      "羊",
      "猴",
      "鸡",
      "兔"
    ]
  },
  "optTails": [
    1,
    3,
    5,
    9,
    2,
    4,
    6
  ],
  "numbers": [
    33,
    35,
    36,
    9,
    11,
    12,
    45,
    47,
    48,
    21,
    23,
    24,
    34,
    6,
    4,
    16
  ],
  "killZodiacs": []
};