var ensembleData = {
  "time": "2026-10-18 21:32:32",
  "issue": "2026291",
  "code": "32,10,41,38,22,02,17",
  "zodiac": "猪,鸡,虎,蛇,鸡,蛇,虎",
  "wave": "green,blue,blue,green,green,red,green",
  "teSx": "虎",
  "teWei": 7,
  "nextIssue": "2026292",
  "ninePool": [
    "狗",
    "马",
    "鸡",
    "猴",
    "鼠",
    "猪",
    "龙",
    "蛇",
    "牛"
  ],
  "sixPool": [
    "狗",
    "马",
    "鸡",
    "猴",
    "鼠",
    "猪"
  ],
  "five": [
    "狗",
    "马",
    "鸡",
    "猴",
    "鼠"
  ],
  "four": [
    "狗",
    "马",
    "鸡",
    "猴"
  ],
  "three": [
    "狗",
    "马",
    "鸡"
  ],
  "pools": {
    "3": [
      "狗",
      "马",
      "鸡"
    ],
    "4": [
      "狗",
      "马",
      "鸡",
      "猴"
    ],
    "5": [
      "狗",
      "马",
      "鸡",
      "猴",
      "鼠"
    ]
  },
  "optTails": [
    9,
    1,
    3,
    5,
    7,
    0,
    2
  ],
  "numbers": [
    1,
    33,
    34,
    37,
    9,
    10,
    45,
    13,
    46,
    49,
    21,
    22,
    25,
    43,
    44,
    20
  ],
  "killZodiacs": []
};