var ensembleData = {
  "time": "2026-07-25 21:32:32",
  "issue": "2026206",
  "code": "09,49,37,03,40,35,47",
  "zodiac": "狗,马,马,龙,兔,猴,猴",
  "wave": "blue,green,blue,blue,red,red,blue",
  "teSx": "猴",
  "teWei": 7,
  "nextIssue": "2026207",
  "ninePool": [
    "鸡",
    "狗",
    "猪",
    "鼠",
    "马",
    "牛",
    "兔",
    "蛇",
    "猴"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "猪",
    "鼠",
    "马",
    "牛"
  ],
  "five": [
    "鸡",
    "猪",
    "狗",
    "鼠",
    "马"
  ],
  "four": [
    "鸡",
    "猪",
    "狗",
    "鼠"
  ],
  "three": [
    "鸡",
    "猪",
    "狗"
  ],
  "pools": {
    "3": [
      "鸡",
      "猪",
      "狗"
    ],
    "4": [
      "鸡",
      "猪",
      "狗",
      "鼠"
    ],
    "5": [
      "鸡",
      "猪",
      "狗",
      "鼠",
      "马"
    ]
  },
  "optTails": [
    0,
    2,
    4,
    6,
    8,
    9,
    1
  ],
  "numbers": [
    32,
    33,
    34,
    8,
    9,
    10,
    44,
    45,
    46,
    20,
    21,
    22,
    30,
    43,
    42,
    13
  ],
  "killZodiacs": []
};