var ensembleData = {
  "time": "2026-09-25 21:32:32",
  "issue": "2026268",
  "code": "48,34,11,21,19,36,40",
  "zodiac": "羊,鸡,猴,狗,鼠,羊,兔",
  "wave": "blue,red,green,green,red,blue,red",
  "teSx": "兔",
  "teWei": 0,
  "nextIssue": "2026269",
  "ninePool": [
    "牛",
    "猴",
    "鼠",
    "鸡",
    "羊",
    "蛇",
    "虎",
    "龙",
    "马"
  ],
  "sixPool": [
    "牛",
    "猴",
    "鼠",
    "鸡",
    "羊",
    "蛇"
  ],
  "five": [
    "牛",
    "猴",
    "鼠",
    "鸡",
    "羊"
  ],
  "four": [
    "牛",
    "猴",
    "鼠",
    "鸡"
  ],
  "three": [
    "牛",
    "猴",
    "鼠"
  ],
  "pools": {
    "3": [
      "牛",
      "猴",
      "鼠"
    ],
    "4": [
      "牛",
      "猴",
      "鼠",
      "鸡"
    ],
    "5": [
      "牛",
      "猴",
      "鼠",
      "鸡",
      "羊"
    ]
  },
  "optTails": [
    1,
    3,
    7,
    6,
    8,
    0,
    2
  ],
  "numbers": [
    35,
    6,
    7,
    42,
    11,
    43,
    47,
    18,
    19,
    23,
    30,
    31,
    34,
    36,
    26,
    12
  ],
  "killZodiacs": []
};