var ensembleData = {
  "time": "2026-09-01 21:32:32",
  "issue": "2026244",
  "code": "09,14,03,17,33,40,46",
  "zodiac": "狗,蛇,龙,虎,狗,兔,鸡",
  "wave": "blue,blue,blue,green,green,red,red",
  "teSx": "鸡",
  "teWei": 6,
  "nextIssue": "2026245",
  "ninePool": [
    "兔",
    "龙",
    "牛",
    "鼠",
    "羊",
    "猴",
    "狗",
    "蛇",
    "猪"
  ],
  "sixPool": [
    "兔",
    "龙",
    "牛",
    "鼠",
    "羊",
    "猴"
  ],
  "five": [
    "兔",
    "龙",
    "牛",
    "鼠",
    "羊"
  ],
  "four": [
    "兔",
    "龙",
    "牛",
    "鼠"
  ],
  "three": [
    "兔",
    "龙",
    "牛"
  ],
  "pools": {
    "3": [
      "兔",
      "龙",
      "牛"
    ],
    "4": [
      "兔",
      "龙",
      "牛",
      "鼠"
    ],
    "5": [
      "兔",
      "龙",
      "牛",
      "鼠",
      "羊"
    ]
  },
  "optTails": [
    6,
    8,
    0,
    4,
    3,
    5,
    7
  ],
  "numbers": [
    3,
    4,
    6,
    39,
    40,
    42,
    15,
    16,
    18,
    27,
    28,
    30,
    24,
    36,
    31,
    43
  ],
  "killZodiacs": []
};