var ensembleData = {
  "time": "2026-07-27 21:32:32",
  "issue": "2026208",
  "code": "07,48,40,35,23,28,19",
  "zodiac": "鼠,羊,兔,猴,猴,兔,鼠",
  "wave": "red,blue,red,red,red,green,red",
  "teSx": "鼠",
  "teWei": 9,
  "nextIssue": "2026209",
  "ninePool": [
    "牛",
    "羊",
    "鸡",
    "狗",
    "马",
    "龙",
    "鼠",
    "蛇",
    "虎"
  ],
  "sixPool": [
    "牛",
    "羊",
    "鸡",
    "狗",
    "马",
    "龙"
  ],
  "five": [
    "羊",
    "牛",
    "狗",
    "马",
    "鸡"
  ],
  "four": [
    "羊",
    "牛",
    "狗",
    "马"
  ],
  "three": [
    "羊",
    "牛",
    "狗"
  ],
  "pools": {
    "3": [
      "羊",
      "牛",
      "狗"
    ],
    "4": [
      "羊",
      "牛",
      "狗",
      "马"
    ],
    "5": [
      "羊",
      "牛",
      "狗",
      "马",
      "鸡"
    ]
  },
  "optTails": [
    2,
    6,
    8,
    4,
    0,
    9,
    1
  ],
  "numbers": [
    33,
    36,
    6,
    9,
    42,
    12,
    45,
    48,
    18,
    21,
    24,
    30,
    34,
    22,
    46,
    13
  ],
  "killZodiacs": []
};