var ensembleData = {
  "time": "2026-07-15 21:32:32",
  "issue": "2026196",
  "code": "03,37,24,10,41,19,39",
  "zodiac": "龙,马,羊,鸡,虎,鼠,龙",
  "wave": "blue,blue,red,blue,blue,red,green",
  "teSx": "龙",
  "teWei": 9,
  "nextIssue": "2026197",
  "ninePool": [
    "猴",
    "鸡",
    "猪",
    "狗",
    "牛",
    "鼠",
    "兔",
    "羊",
    "虎"
  ],
  "sixPool": [
    "猴",
    "鸡",
    "猪",
    "狗",
    "牛",
    "鼠"
  ],
  "five": [
    "鼠",
    "猴",
    "牛",
    "猪",
    "鸡"
  ],
  "four": [
    "鼠",
    "猴",
    "牛",
    "猪"
  ],
  "three": [
    "鼠",
    "猴",
    "牛"
  ],
  "pools": {
    "3": [
      "鼠",
      "猴",
      "牛"
    ],
    "4": [
      "鼠",
      "猴",
      "牛",
      "猪"
    ],
    "5": [
      "鼠",
      "猴",
      "牛",
      "猪",
      "鸡"
    ]
  },
  "optTails": [
    7,
    1,
    3,
    9,
    5,
    6,
    8
  ],
  "numbers": [
    35,
    6,
    7,
    42,
    11,
    43,
    47,
    18,
    19,
    23,
    30,
    31,
    34,
    20,
    22,
    33
  ],
  "killZodiacs": []
};