var ensembleData = {
  "time": "2026-07-22 21:32:32",
  "issue": "2026203",
  "code": "12,11,31,03,44,37,25",
  "zodiac": "羊,猴,鼠,龙,猪,马,马",
  "wave": "red,green,blue,blue,green,blue,blue",
  "teSx": "马",
  "teWei": 5,
  "nextIssue": "2026204",
  "ninePool": [
    "鸡",
    "猴",
    "牛",
    "鼠",
    "狗",
    "羊",
    "蛇",
    "虎",
    "龙"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "牛",
    "鼠",
    "狗",
    "羊"
  ],
  "five": [
    "鸡",
    "猴",
    "狗",
    "牛",
    "鼠"
  ],
  "four": [
    "鸡",
    "猴",
    "狗",
    "牛"
  ],
  "three": [
    "鸡",
    "猴",
    "狗"
  ],
  "pools": {
    "3": [
      "鸡",
      "猴",
      "狗"
    ],
    "4": [
      "鸡",
      "猴",
      "狗",
      "牛"
    ],
    "5": [
      "鸡",
      "猴",
      "狗",
      "牛",
      "鼠"
    ]
  },
  "optTails": [
    1,
    3,
    5,
    0,
    2,
    4,
    6
  ],
  "numbers": [
    33,
    34,
    35,
    9,
    10,
    11,
    45,
    46,
    47,
    21,
    22,
    23,
    12,
    42,
    48,
    31
  ],
  "killZodiacs": []
};