var ensembleData = {
  "time": "2026-07-26 21:32:32",
  "issue": "2026207",
  "code": "09,40,26,23,44,13,31",
  "zodiac": "狗,兔,蛇,猴,猪,马,鼠",
  "wave": "blue,red,blue,red,green,red,blue",
  "teSx": "鼠",
  "teWei": 1,
  "nextIssue": "2026208",
  "ninePool": [
    "鸡",
    "马",
    "羊",
    "狗",
    "龙",
    "牛",
    "蛇",
    "虎",
    "猪"
  ],
  "sixPool": [
    "鸡",
    "马",
    "羊",
    "狗",
    "龙",
    "牛"
  ],
  "five": [
    "鸡",
    "马",
    "羊",
    "狗",
    "龙"
  ],
  "four": [
    "鸡",
    "马",
    "羊",
    "狗"
  ],
  "three": [
    "鸡",
    "马",
    "羊"
  ],
  "pools": {
    "3": [
      "鸡",
      "马",
      "羊"
    ],
    "4": [
      "鸡",
      "马",
      "羊",
      "狗"
    ],
    "5": [
      "鸡",
      "马",
      "羊",
      "狗",
      "龙"
    ]
  },
  "optTails": [
    2,
    4,
    6,
    0,
    1,
    3,
    5
  ],
  "numbers": [
    1,
    34,
    36,
    37,
    10,
    12,
    13,
    46,
    48,
    49,
    22,
    24,
    25,
    30,
    33,
    42
  ],
  "killZodiacs": []
};