var ensembleData = {
  "time": "2026-10-10 21:32:32",
  "issue": "2026283",
  "code": "35,08,15,06,21,01,18",
  "zodiac": "猴,猪,龙,牛,狗,马,牛",
  "wave": "red,red,blue,green,green,red,red",
  "teSx": "牛",
  "teWei": 8,
  "nextIssue": "2026284",
  "ninePool": [
    "羊",
    "兔",
    "猪",
    "虎",
    "马",
    "鼠",
    "蛇",
    "狗",
    "龙"
  ],
  "sixPool": [
    "羊",
    "兔",
    "猪",
    "虎",
    "马",
    "鼠"
  ],
  "five": [
    "羊",
    "猪",
    "虎",
    "兔",
    "鼠"
  ],
  "four": [
    "羊",
    "猪",
    "虎",
    "兔"
  ],
  "three": [
    "羊",
    "猪",
    "虎"
  ],
  "pools": {
    "3": [
      "羊",
      "猪",
      "虎"
    ],
    "4": [
      "羊",
      "猪",
      "虎",
      "兔"
    ],
    "5": [
      "羊",
      "猪",
      "虎",
      "兔",
      "鼠"
    ]
  },
  "optTails": [
    2,
    4,
    8,
    6,
    0,
    5,
    7
  ],
  "numbers": [
    32,
    36,
    5,
    8,
    41,
    12,
    44,
    48,
    17,
    20,
    24,
    29,
    25,
    31,
    4,
    37
  ],
  "killZodiacs": []
};