var ensembleData = {
  "time": "2026-10-24 21:32:32",
  "issue": "2026297",
  "code": "27,40,25,26,33,09,13",
  "zodiac": "龙,兔,马,蛇,狗,狗,马",
  "wave": "green,red,blue,blue,green,blue,red",
  "teSx": "马",
  "teWei": 3,
  "nextIssue": "2026298",
  "ninePool": [
    "牛",
    "狗",
    "猪",
    "虎",
    "兔",
    "鸡",
    "羊",
    "龙",
    "蛇"
  ],
  "sixPool": [
    "牛",
    "狗",
    "猪",
    "虎",
    "兔",
    "鸡"
  ],
  "five": [
    "猪",
    "牛",
    "兔",
    "狗",
    "虎"
  ],
  "four": [
    "猪",
    "牛",
    "兔",
    "狗"
  ],
  "three": [
    "猪",
    "牛",
    "兔"
  ],
  "pools": {
    "3": [
      "猪",
      "牛",
      "兔"
    ],
    "4": [
      "猪",
      "牛",
      "兔",
      "狗"
    ],
    "5": [
      "猪",
      "牛",
      "兔",
      "狗",
      "虎"
    ]
  },
  "optTails": [
    8,
    0,
    2,
    4,
    6,
    3,
    5
  ],
  "numbers": [
    32,
    4,
    6,
    8,
    40,
    42,
    44,
    16,
    18,
    20,
    28,
    30,
    34,
    41,
    46,
    21
  ],
  "killZodiacs": []
};