var ensembleData = {
  "time": "2026-08-26 21:32:32",
  "issue": "2026238",
  "code": "35,44,23,04,07,21,17",
  "zodiac": "猴,猪,猴,兔,鼠,狗,虎",
  "wave": "red,green,red,blue,red,green,green",
  "teSx": "虎",
  "teWei": 7,
  "nextIssue": "2026239",
  "ninePool": [
    "马",
    "龙",
    "狗",
    "鼠",
    "鸡",
    "羊",
    "猪",
    "牛",
    "蛇"
  ],
  "sixPool": [
    "马",
    "龙",
    "狗",
    "鼠",
    "鸡",
    "羊"
  ],
  "five": [
    "狗",
    "龙",
    "鼠",
    "马",
    "鸡"
  ],
  "four": [
    "狗",
    "龙",
    "鼠",
    "马"
  ],
  "three": [
    "狗",
    "龙",
    "鼠"
  ],
  "pools": {
    "3": [
      "狗",
      "龙",
      "鼠"
    ],
    "4": [
      "狗",
      "龙",
      "鼠",
      "马"
    ],
    "5": [
      "狗",
      "龙",
      "鼠",
      "马",
      "鸡"
    ]
  },
  "optTails": [
    9,
    3,
    1,
    5,
    7,
    2,
    0
  ],
  "numbers": [
    33,
    3,
    39,
    7,
    9,
    43,
    45,
    15,
    19,
    21,
    27,
    31,
    34,
    46,
    13,
    24
  ],
  "killZodiacs": []
};