var ensembleData = {
  "time": "2026-08-15 21:32:32",
  "issue": "2026227",
  "code": "23,24,29,07,13,31,16",
  "zodiac": "猴,羊,虎,鼠,马,鼠,兔",
  "wave": "red,red,red,red,red,blue,green",
  "teSx": "兔",
  "teWei": 6,
  "nextIssue": "2026228",
  "ninePool": [
    "羊",
    "龙",
    "鸡",
    "猪",
    "牛",
    "鼠",
    "狗",
    "虎",
    "蛇"
  ],
  "sixPool": [
    "羊",
    "龙",
    "鸡",
    "猪",
    "牛",
    "鼠"
  ],
  "five": [
    "龙",
    "鼠",
    "羊",
    "鸡",
    "猪"
  ],
  "four": [
    "龙",
    "鼠",
    "羊",
    "鸡"
  ],
  "three": [
    "龙",
    "鼠",
    "羊"
  ],
  "pools": {
    "3": [
      "龙",
      "鼠",
      "羊"
    ],
    "4": [
      "龙",
      "鼠",
      "羊",
      "鸡"
    ],
    "5": [
      "龙",
      "鼠",
      "羊",
      "鸡",
      "猪"
    ]
  },
  "optTails": [
    3,
    7,
    9,
    5,
    1,
    2,
    4
  ],
  "numbers": [
    3,
    36,
    7,
    39,
    43,
    12,
    15,
    48,
    19,
    24,
    27,
    31,
    34,
    22,
    42,
    44
  ],
  "killZodiacs": []
};