var ensembleData = {
  "time": "2026-07-16 21:32:32",
  "issue": "2026197",
  "code": "40,19,30,48,44,28,08",
  "zodiac": "兔,鼠,牛,羊,猪,兔,猪",
  "wave": "red,red,red,blue,green,green,red",
  "teSx": "猪",
  "teWei": 8,
  "nextIssue": "2026198",
  "ninePool": [
    "羊",
    "鼠",
    "鸡",
    "牛",
    "虎",
    "马",
    "猴",
    "兔",
    "猪"
  ],
  "sixPool": [
    "羊",
    "鼠",
    "鸡",
    "牛",
    "虎",
    "马"
  ],
  "five": [
    "牛",
    "鼠",
    "羊",
    "鸡",
    "虎"
  ],
  "four": [
    "牛",
    "鼠",
    "羊",
    "鸡"
  ],
  "three": [
    "牛",
    "鼠",
    "羊"
  ],
  "pools": {
    "3": [
      "牛",
      "鼠",
      "羊"
    ],
    "4": [
      "牛",
      "鼠",
      "羊",
      "鸡"
    ],
    "5": [
      "牛",
      "鼠",
      "羊",
      "鸡",
      "虎"
    ]
  },
  "optTails": [
    6,
    8,
    2,
    0,
    7,
    9,
    1
  ],
  "numbers": [
    36,
    6,
    7,
    42,
    43,
    12,
    48,
    18,
    19,
    24,
    30,
    31,
    34,
    17,
    13,
    37
  ],
  "killZodiacs": []
};