var ensembleData = {
  "time": "2026-08-12 21:32:32",
  "issue": "2026224",
  "code": "25,19,08,49,18,36,09",
  "zodiac": "马,鼠,猪,马,牛,羊,狗",
  "wave": "blue,red,red,green,red,blue,blue",
  "teSx": "狗",
  "teWei": 9,
  "nextIssue": "2026225",
  "ninePool": [
    "鸡",
    "鼠",
    "马",
    "猪",
    "牛",
    "兔",
    "虎",
    "羊",
    "龙"
  ],
  "sixPool": [
    "鸡",
    "鼠",
    "马",
    "猪",
    "牛",
    "兔"
  ],
  "five": [
    "鼠",
    "鸡",
    "马",
    "猪",
    "牛"
  ],
  "four": [
    "鼠",
    "鸡",
    "马",
    "猪"
  ],
  "three": [
    "鼠",
    "鸡",
    "马"
  ],
  "pools": {
    "3": [
      "鼠",
      "鸡",
      "马"
    ],
    "4": [
      "鼠",
      "鸡",
      "马",
      "猪"
    ],
    "5": [
      "鼠",
      "鸡",
      "马",
      "猪",
      "牛"
    ]
  },
  "optTails": [
    7,
    9,
    1,
    3,
    0,
    2,
    4
  ],
  "numbers": [
    1,
    34,
    37,
    7,
    10,
    43,
    13,
    46,
    49,
    19,
    22,
    25,
    31,
    20,
    30,
    44
  ],
  "killZodiacs": []
};