var ensembleData = {
  "time": "2026-07-23 21:32:32",
  "issue": "2026204",
  "code": "11,12,17,26,10,07,05",
  "zodiac": "猴,羊,虎,蛇,鸡,鼠,虎",
  "wave": "green,red,green,blue,blue,red,green",
  "teSx": "虎",
  "teWei": 5,
  "nextIssue": "2026205",
  "ninePool": [
    "猴",
    "鸡",
    "马",
    "狗",
    "龙",
    "羊",
    "鼠",
    "蛇",
    "兔"
  ],
  "sixPool": [
    "猴",
    "鸡",
    "马",
    "狗",
    "龙",
    "羊"
  ],
  "five": [
    "猴",
    "狗",
    "马",
    "鸡",
    "龙"
  ],
  "four": [
    "猴",
    "狗",
    "马",
    "鸡"
  ],
  "three": [
    "猴",
    "狗",
    "马"
  ],
  "pools": {
    "3": [
      "猴",
      "狗",
      "马"
    ],
    "4": [
      "猴",
      "狗",
      "马",
      "鸡"
    ],
    "5": [
      "猴",
      "狗",
      "马",
      "鸡",
      "龙"
    ]
  },
  "optTails": [
    1,
    3,
    5,
    7,
    9,
    0,
    2
  ],
  "numbers": [
    33,
    1,
    35,
    37,
    9,
    11,
    45,
    13,
    47,
    49,
    21,
    23,
    25,
    34,
    12,
    22
  ],
  "killZodiacs": []
};