var ensembleData = {
  "time": "2026-09-06 21:32:32",
  "issue": "2026249",
  "code": "41,22,13,36,26,29,23",
  "zodiac": "虎,鸡,马,羊,蛇,虎,猴",
  "wave": "blue,green,red,blue,blue,red,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026250",
  "ninePool": [
    "狗",
    "鼠",
    "鸡",
    "马",
    "羊",
    "虎",
    "牛",
    "蛇",
    "龙"
  ],
  "sixPool": [
    "狗",
    "鼠",
    "鸡",
    "马",
    "羊",
    "虎"
  ],
  "five": [
    "鼠",
    "狗",
    "鸡",
    "马",
    "羊"
  ],
  "four": [
    "鼠",
    "狗",
    "鸡",
    "马"
  ],
  "three": [
    "鼠",
    "狗",
    "鸡"
  ],
  "pools": {
    "3": [
      "鼠",
      "狗",
      "鸡"
    ],
    "4": [
      "鼠",
      "狗",
      "鸡",
      "马"
    ],
    "5": [
      "鼠",
      "狗",
      "鸡",
      "马",
      "羊"
    ]
  },
  "optTails": [
    9,
    1,
    3,
    7,
    5,
    0,
    2
  ],
  "numbers": [
    33,
    34,
    7,
    9,
    10,
    43,
    45,
    46,
    19,
    21,
    22,
    31,
    13,
    24,
    36,
    12
  ],
  "killZodiacs": []
};