var ensembleData = {
  "time": "2026-10-09 21:32:32",
  "issue": "2026282",
  "code": "44,03,37,46,29,20,23",
  "zodiac": "猪,龙,马,鸡,虎,猪,猴",
  "wave": "green,blue,blue,red,red,blue,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026283",
  "ninePool": [
    "羊",
    "狗",
    "猪",
    "虎",
    "鸡",
    "牛",
    "兔",
    "鼠",
    "猴"
  ],
  "sixPool": [
    "羊",
    "狗",
    "猪",
    "虎",
    "鸡",
    "牛"
  ],
  "five": [
    "羊",
    "虎",
    "猪",
    "狗",
    "牛"
  ],
  "four": [
    "羊",
    "虎",
    "猪",
    "狗"
  ],
  "three": [
    "羊",
    "虎",
    "猪"
  ],
  "pools": {
    "3": [
      "羊",
      "虎",
      "猪"
    ],
    "4": [
      "羊",
      "虎",
      "猪",
      "狗"
    ],
    "5": [
      "羊",
      "虎",
      "猪",
      "狗",
      "牛"
    ]
  },
  "optTails": [
    2,
    4,
    8,
    6,
    5,
    7,
    9
  ],
  "numbers": [
    32,
    36,
    5,
    8,
    41,
    12,
    44,
    48,
    17,
    20,
    24,
    29,
    34,
    6,
    42,
    46
  ],
  "killZodiacs": []
};