var ensembleData = {
  "time": "2026-08-04 21:32:32",
  "issue": "2026216",
  "code": "18,41,32,44,36,45,37",
  "zodiac": "牛,虎,猪,猪,羊,狗,马",
  "wave": "red,blue,green,green,blue,red,blue",
  "teSx": "马",
  "teWei": 7,
  "nextIssue": "2026217",
  "ninePool": [
    "鸡",
    "狗",
    "羊",
    "猴",
    "龙",
    "猪",
    "牛",
    "兔",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "羊",
    "猴",
    "龙",
    "猪"
  ],
  "five": [
    "羊",
    "鸡",
    "狗",
    "龙",
    "猴"
  ],
  "four": [
    "羊",
    "鸡",
    "狗",
    "龙"
  ],
  "three": [
    "羊",
    "鸡",
    "狗"
  ],
  "pools": {
    "3": [
      "羊",
      "鸡",
      "狗"
    ],
    "4": [
      "羊",
      "鸡",
      "狗",
      "龙"
    ],
    "5": [
      "羊",
      "鸡",
      "狗",
      "龙",
      "猴"
    ]
  },
  "optTails": [
    2,
    4,
    6,
    8,
    0,
    9,
    1
  ],
  "numbers": [
    33,
    34,
    36,
    9,
    10,
    12,
    45,
    46,
    48,
    21,
    22,
    24,
    27,
    15,
    47,
    8
  ],
  "killZodiacs": []
};