var ensembleData = {
  "time": "2026-09-24 21:32:32",
  "issue": "2026267",
  "code": "16,20,25,22,09,41,40",
  "zodiac": "兔,猪,马,鸡,狗,虎,兔",
  "wave": "green,blue,blue,green,blue,blue,red",
  "teSx": "兔",
  "teWei": 0,
  "nextIssue": "2026268",
  "ninePool": [
    "蛇",
    "猪",
    "龙",
    "狗",
    "马",
    "牛",
    "猴",
    "兔",
    "羊"
  ],
  "sixPool": [
    "蛇",
    "猪",
    "龙",
    "狗",
    "马",
    "牛"
  ],
  "five": [
    "蛇",
    "猪",
    "龙",
    "狗",
    "马"
  ],
  "four": [
    "蛇",
    "猪",
    "龙",
    "狗"
  ],
  "three": [
    "蛇",
    "猪",
    "龙"
  ],
  "pools": {
    "3": [
      "蛇",
      "猪",
      "龙"
    ],
    "4": [
      "蛇",
      "猪",
      "龙",
      "狗"
    ],
    "5": [
      "蛇",
      "猪",
      "龙",
      "狗",
      "马"
    ]
  },
  "optTails": [
    2,
    4,
    8,
    6,
    0,
    3,
    5
  ],
  "numbers": [
    32,
    2,
    3,
    38,
    39,
    8,
    44,
    14,
    15,
    20,
    26,
    27,
    33,
    13,
    45,
    25
  ],
  "killZodiacs": []
};