var ensembleData = {
  "time": "2026-10-17 21:32:32",
  "issue": "2026290",
  "code": "08,09,17,15,07,02,40",
  "zodiac": "猪,狗,虎,龙,鼠,蛇,兔",
  "wave": "red,blue,green,blue,red,red,red",
  "teSx": "兔",
  "teWei": 0,
  "nextIssue": "2026291",
  "ninePool": [
    "龙",
    "牛",
    "猪",
    "蛇",
    "鼠",
    "兔",
    "猴",
    "羊",
    "鸡"
  ],
  "sixPool": [
    "龙",
    "牛",
    "猪",
    "蛇",
    "鼠",
    "兔"
  ],
  "five": [
    "猪",
    "蛇",
    "龙",
    "牛",
    "鼠"
  ],
  "four": [
    "猪",
    "蛇",
    "龙",
    "牛"
  ],
  "three": [
    "猪",
    "蛇",
    "龙"
  ],
  "pools": {
    "3": [
      "猪",
      "蛇",
      "龙"
    ],
    "4": [
      "猪",
      "蛇",
      "龙",
      "牛"
    ],
    "5": [
      "猪",
      "蛇",
      "龙",
      "牛",
      "鼠"
    ]
  },
  "optTails": [
    8,
    2,
    4,
    0,
    6,
    3,
    5
  ],
  "numbers": [
    32,
    2,
    3,
    38,
    39,
    8,
    44,
    14,
    15,
    20,
    26,
    27,
    31,
    6,
    43,
    42
  ],
  "killZodiacs": []
};