var ensembleData = {
  "time": "2026-10-14 21:32:32",
  "issue": "2026287",
  "code": "19,47,38,35,06,17,08",
  "zodiac": "鼠,猴,蛇,猴,牛,虎,猪",
  "wave": "red,blue,green,red,green,green,red",
  "teSx": "猪",
  "teWei": 8,
  "nextIssue": "2026288",
  "ninePool": [
    "鸡",
    "兔",
    "龙",
    "马",
    "羊",
    "猴",
    "虎",
    "蛇",
    "猪"
  ],
  "sixPool": [
    "鸡",
    "兔",
    "龙",
    "马",
    "羊",
    "猴"
  ],
  "five": [
    "龙",
    "兔",
    "鸡",
    "羊",
    "马"
  ],
  "four": [
    "龙",
    "兔",
    "鸡",
    "羊"
  ],
  "three": [
    "龙",
    "兔",
    "鸡"
  ],
  "pools": {
    "3": [
      "龙",
      "兔",
      "鸡"
    ],
    "4": [
      "龙",
      "兔",
      "鸡",
      "羊"
    ],
    "5": [
      "龙",
      "兔",
      "鸡",
      "羊",
      "马"
    ]
  },
  "optTails": [
    4,
    6,
    0,
    3,
    5,
    7,
    9
  ],
  "numbers": [
    34,
    3,
    4,
    39,
    40,
    10,
    46,
    15,
    16,
    22,
    27,
    28,
    36,
    25,
    1,
    49
  ],
  "killZodiacs": []
};