var ensembleData = {
  "time": "2026-09-22 21:32:32",
  "issue": "2026265",
  "code": "05,46,40,23,26,44,49",
  "zodiac": "虎,鸡,兔,猴,蛇,猪,马",
  "wave": "green,red,red,red,blue,green,green",
  "teSx": "马",
  "teWei": 9,
  "nextIssue": "2026266",
  "ninePool": [
    "猴",
    "羊",
    "龙",
    "鸡",
    "鼠",
    "牛",
    "狗",
    "蛇",
    "虎"
  ],
  "sixPool": [
    "猴",
    "羊",
    "龙",
    "鸡",
    "鼠",
    "牛"
  ],
  "five": [
    "龙",
    "猴",
    "鼠",
    "羊",
    "鸡"
  ],
  "four": [
    "龙",
    "猴",
    "鼠",
    "羊"
  ],
  "three": [
    "龙",
    "猴",
    "鼠"
  ],
  "pools": {
    "3": [
      "龙",
      "猴",
      "鼠"
    ],
    "4": [
      "龙",
      "猴",
      "鼠",
      "羊"
    ],
    "5": [
      "龙",
      "猴",
      "鼠",
      "羊",
      "鸡"
    ]
  },
  "optTails": [
    3,
    7,
    5,
    9,
    1,
    0,
    4
  ],
  "numbers": [
    3,
    35,
    39,
    7,
    11,
    43,
    15,
    47,
    19,
    23,
    27,
    31,
    34,
    36,
    6,
    48
  ],
  "killZodiacs": []
};