var ensembleData = {
  "time": "2026-08-11 21:32:32",
  "issue": "2026223",
  "code": "21,43,01,38,29,44,23",
  "zodiac": "狗,鼠,马,蛇,虎,猪,猴",
  "wave": "green,green,red,green,red,green,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026224",
  "ninePool": [
    "龙",
    "虎",
    "蛇",
    "羊",
    "猪",
    "狗",
    "鼠",
    "马",
    "鸡"
  ],
  "sixPool": [
    "龙",
    "虎",
    "蛇",
    "羊",
    "猪",
    "狗"
  ],
  "five": [
    "龙",
    "虎",
    "羊",
    "蛇",
    "猪"
  ],
  "four": [
    "龙",
    "虎",
    "羊",
    "蛇"
  ],
  "three": [
    "龙",
    "虎",
    "羊"
  ],
  "pools": {
    "3": [
      "龙",
      "虎",
      "羊"
    ],
    "4": [
      "龙",
      "虎",
      "羊",
      "蛇"
    ],
    "5": [
      "龙",
      "虎",
      "羊",
      "蛇",
      "猪"
    ]
  },
  "optTails": [
    5,
    7,
    9,
    3,
    1,
    2,
    4
  ],
  "numbers": [
    3,
    36,
    5,
    39,
    41,
    12,
    15,
    48,
    17,
    24,
    27,
    29,
    20,
    33,
    21,
    9
  ],
  "killZodiacs": []
};