var ensembleData = {
  "time": "2026-09-13 21:32:32",
  "issue": "2026256",
  "code": "40,15,09,37,07,03,01",
  "zodiac": "兔,龙,狗,马,鼠,龙,马",
  "wave": "red,blue,blue,blue,red,blue,red",
  "teSx": "马",
  "teWei": 1,
  "nextIssue": "2026257",
  "ninePool": [
    "猴",
    "虎",
    "龙",
    "狗",
    "蛇",
    "兔",
    "牛",
    "鼠",
    "羊"
  ],
  "sixPool": [
    "猴",
    "虎",
    "龙",
    "狗",
    "蛇",
    "兔"
  ],
  "five": [
    "虎",
    "猴",
    "龙",
    "狗",
    "蛇"
  ],
  "four": [
    "虎",
    "猴",
    "龙",
    "狗"
  ],
  "three": [
    "虎",
    "猴",
    "龙"
  ],
  "pools": {
    "3": [
      "虎",
      "猴",
      "龙"
    ],
    "4": [
      "虎",
      "猴",
      "龙",
      "狗"
    ],
    "5": [
      "虎",
      "猴",
      "龙",
      "狗",
      "蛇"
    ]
  },
  "optTails": [
    5,
    7,
    9,
    1,
    3,
    2,
    4
  ],
  "numbers": [
    35,
    3,
    5,
    39,
    41,
    11,
    47,
    15,
    17,
    23,
    27,
    29,
    33,
    45,
    26,
    21
  ],
  "killZodiacs": []
};