var ensembleData = {
  "time": "2026-09-14 21:32:32",
  "issue": "2026257",
  "code": "08,46,47,39,27,45,07",
  "zodiac": "猪,鸡,猴,龙,龙,狗,鼠",
  "wave": "red,red,blue,green,green,red,red",
  "teSx": "鼠",
  "teWei": 7,
  "nextIssue": "2026258",
  "ninePool": [
    "狗",
    "虎",
    "鸡",
    "羊",
    "马",
    "兔",
    "猪",
    "猴",
    "龙"
  ],
  "sixPool": [
    "狗",
    "虎",
    "鸡",
    "羊",
    "马",
    "兔"
  ],
  "five": [
    "狗",
    "鸡",
    "虎",
    "兔",
    "马"
  ],
  "four": [
    "狗",
    "鸡",
    "虎",
    "兔"
  ],
  "three": [
    "狗",
    "鸡",
    "虎"
  ],
  "pools": {
    "3": [
      "狗",
      "鸡",
      "虎"
    ],
    "4": [
      "狗",
      "鸡",
      "虎",
      "兔"
    ],
    "5": [
      "狗",
      "鸡",
      "虎",
      "兔",
      "马"
    ]
  },
  "optTails": [
    9,
    1,
    5,
    3,
    0,
    2,
    4
  ],
  "numbers": [
    33,
    34,
    5,
    9,
    10,
    41,
    45,
    46,
    17,
    21,
    22,
    29,
    13,
    28,
    36,
    48
  ],
  "killZodiacs": []
};