var ensembleData = {
  "time": "2026-09-02 21:32:32",
  "issue": "2026245",
  "code": "22,23,14,02,13,38,18",
  "zodiac": "鸡,猴,蛇,蛇,马,蛇,牛",
  "wave": "green,red,blue,red,red,green,red",
  "teSx": "牛",
  "teWei": 8,
  "nextIssue": "2026246",
  "ninePool": [
    "猪",
    "猴",
    "兔",
    "羊",
    "虎",
    "蛇",
    "马",
    "鼠",
    "狗"
  ],
  "sixPool": [
    "猪",
    "猴",
    "兔",
    "羊",
    "虎",
    "蛇"
  ],
  "five": [
    "猴",
    "猪",
    "蛇",
    "兔",
    "虎"
  ],
  "four": [
    "猴",
    "猪",
    "蛇",
    "兔"
  ],
  "three": [
    "猴",
    "猪",
    "蛇"
  ],
  "pools": {
    "3": [
      "猴",
      "猪",
      "蛇"
    ],
    "4": [
      "猴",
      "猪",
      "蛇",
      "兔"
    ],
    "5": [
      "猴",
      "猪",
      "蛇",
      "兔",
      "虎"
    ]
  },
  "optTails": [
    8,
    2,
    4,
    1,
    3,
    5,
    7
  ],
  "numbers": [
    32,
    2,
    35,
    38,
    8,
    11,
    44,
    14,
    47,
    20,
    23,
    26,
    28,
    24,
    36,
    4
  ],
  "killZodiacs": []
};