var ensembleData = {
  "time": "2026-08-18 21:32:32",
  "issue": "2026230",
  "code": "28,26,47,14,49,10,16",
  "zodiac": "兔,蛇,猴,蛇,马,鸡,兔",
  "wave": "green,blue,blue,blue,green,blue,green",
  "teSx": "兔",
  "teWei": 6,
  "nextIssue": "2026231",
  "ninePool": [
    "猪",
    "牛",
    "狗",
    "猴",
    "鼠",
    "蛇",
    "龙",
    "鸡",
    "羊"
  ],
  "sixPool": [
    "猪",
    "狗",
    "牛",
    "猴",
    "鼠",
    "蛇"
  ],
  "five": [
    "牛",
    "猪",
    "狗",
    "猴",
    "蛇"
  ],
  "four": [
    "牛",
    "猪",
    "狗",
    "猴"
  ],
  "three": [
    "牛",
    "猪",
    "狗"
  ],
  "pools": {
    "3": [
      "牛",
      "猪",
      "狗"
    ],
    "4": [
      "牛",
      "猪",
      "狗",
      "猴"
    ],
    "5": [
      "牛",
      "猪",
      "狗",
      "猴",
      "蛇"
    ]
  },
  "optTails": [
    8,
    0,
    2,
    6,
    4,
    9,
    1
  ],
  "numbers": [
    32,
    33,
    6,
    8,
    9,
    42,
    44,
    45,
    18,
    20,
    21,
    30,
    2,
    7,
    47,
    14
  ],
  "killZodiacs": []
};