var ensembleData = {
  "time": "2026-08-03 21:32:32",
  "issue": "2026215",
  "code": "19,38,30,13,01,11,14",
  "zodiac": "鼠,蛇,牛,马,马,猴,蛇",
  "wave": "red,green,red,red,red,green,blue",
  "teSx": "蛇",
  "teWei": 4,
  "nextIssue": "2026216",
  "ninePool": [
    "猴",
    "鸡",
    "狗",
    "牛",
    "虎",
    "猪",
    "羊",
    "鼠",
    "马"
  ],
  "sixPool": [
    "猴",
    "鸡",
    "牛",
    "狗",
    "虎",
    "猪"
  ],
  "five": [
    "牛",
    "猴",
    "狗",
    "虎",
    "鸡"
  ],
  "four": [
    "牛",
    "猴",
    "狗",
    "虎"
  ],
  "three": [
    "牛",
    "猴",
    "狗"
  ],
  "pools": {
    "3": [
      "牛",
      "猴",
      "狗"
    ],
    "4": [
      "牛",
      "猴",
      "狗",
      "虎"
    ],
    "5": [
      "牛",
      "猴",
      "狗",
      "虎",
      "鸡"
    ]
  },
  "optTails": [
    1,
    3,
    5,
    6,
    8,
    0,
    2
  ],
  "numbers": [
    33,
    35,
    6,
    9,
    42,
    11,
    45,
    47,
    18,
    21,
    23,
    30,
    17,
    22,
    46,
    32
  ],
  "killZodiacs": []
};