var ensembleData = {
  "time": "2026-07-17 21:32:32",
  "issue": "2026198",
  "code": "48,35,45,21,12,24,07",
  "zodiac": "羊,猴,狗,狗,羊,羊,鼠",
  "wave": "blue,red,red,green,red,red,red",
  "teSx": "鼠",
  "teWei": 7,
  "nextIssue": "2026199",
  "ninePool": [
    "羊",
    "猴",
    "牛",
    "鸡",
    "虎",
    "兔",
    "狗",
    "马",
    "鼠"
  ],
  "sixPool": [
    "羊",
    "猴",
    "牛",
    "鸡",
    "虎",
    "兔"
  ],
  "five": [
    "鸡",
    "羊",
    "猴",
    "兔",
    "牛"
  ],
  "four": [
    "鸡",
    "羊",
    "猴",
    "兔"
  ],
  "three": [
    "鸡",
    "羊",
    "猴"
  ],
  "pools": {
    "3": [
      "鸡",
      "羊",
      "猴"
    ],
    "4": [
      "鸡",
      "羊",
      "猴",
      "兔"
    ],
    "5": [
      "鸡",
      "羊",
      "猴",
      "兔",
      "牛"
    ]
  },
  "optTails": [
    2,
    4,
    6,
    0,
    8,
    1,
    3
  ],
  "numbers": [
    34,
    35,
    36,
    10,
    11,
    12,
    46,
    47,
    48,
    22,
    23,
    24,
    4,
    42,
    28,
    18
  ],
  "killZodiacs": []
};