var ensembleData = {
  "time": "2026-08-09 21:32:32",
  "issue": "2026221",
  "code": "24,14,18,48,46,28,01",
  "zodiac": "羊,蛇,牛,羊,鸡,兔,马",
  "wave": "red,blue,red,blue,red,green,red",
  "teSx": "马",
  "teWei": 1,
  "nextIssue": "2026222",
  "ninePool": [
    "龙",
    "狗",
    "鸡",
    "虎",
    "猪",
    "猴",
    "牛",
    "兔",
    "蛇"
  ],
  "sixPool": [
    "龙",
    "狗",
    "鸡",
    "虎",
    "猪",
    "猴"
  ],
  "five": [
    "龙",
    "虎",
    "鸡",
    "狗",
    "猪"
  ],
  "four": [
    "龙",
    "虎",
    "鸡",
    "狗"
  ],
  "three": [
    "龙",
    "虎",
    "鸡"
  ],
  "pools": {
    "3": [
      "龙",
      "虎",
      "鸡"
    ],
    "4": [
      "龙",
      "虎",
      "鸡",
      "狗"
    ],
    "5": [
      "龙",
      "虎",
      "鸡",
      "狗",
      "猪"
    ]
  },
  "optTails": [
    5,
    7,
    9,
    3,
    1,
    0,
    2
  ],
  "numbers": [
    34,
    3,
    5,
    39,
    41,
    10,
    46,
    15,
    17,
    22,
    27,
    29,
    11,
    33,
    21,
    23
  ],
  "killZodiacs": []
};