var ensembleData = {
  "time": "2026-10-25 21:32:32",
  "issue": "2026298",
  "code": "31,36,40,34,37,43,08",
  "zodiac": "鼠,羊,兔,鸡,马,鼠,猪",
  "wave": "blue,blue,red,red,blue,green,red",
  "teSx": "猪",
  "teWei": 8,
  "nextIssue": "2026299",
  "ninePool": [
    "羊",
    "猴",
    "牛",
    "蛇",
    "龙",
    "鼠",
    "马",
    "虎",
    "兔"
  ],
  "sixPool": [
    "羊",
    "猴",
    "牛",
    "蛇",
    "龙",
    "鼠"
  ],
  "five": [
    "羊",
    "猴",
    "牛",
    "蛇",
    "龙"
  ],
  "four": [
    "羊",
    "猴",
    "牛",
    "蛇"
  ],
  "three": [
    "羊",
    "猴",
    "牛"
  ],
  "pools": {
    "3": [
      "羊",
      "猴",
      "牛"
    ],
    "4": [
      "羊",
      "猴",
      "牛",
      "蛇"
    ],
    "5": [
      "羊",
      "猴",
      "牛",
      "蛇",
      "龙"
    ]
  },
  "optTails": [
    2,
    6,
    8,
    4,
    1,
    3,
    5
  ],
  "numbers": [
    35,
    36,
    6,
    42,
    11,
    12,
    47,
    48,
    18,
    23,
    24,
    30,
    31,
    26,
    27,
    7
  ],
  "killZodiacs": []
};