var ensembleData = {
  "time": "2026-09-26 21:32:32",
  "issue": "2026269",
  "code": "19,40,36,05,38,16,22",
  "zodiac": "鼠,兔,羊,虎,蛇,兔,鸡",
  "wave": "red,red,blue,green,green,green,green",
  "teSx": "鸡",
  "teWei": 2,
  "nextIssue": "2026270",
  "ninePool": [
    "猪",
    "龙",
    "狗",
    "猴",
    "马",
    "牛",
    "羊",
    "虎",
    "蛇"
  ],
  "sixPool": [
    "猪",
    "龙",
    "狗",
    "猴",
    "马",
    "牛"
  ],
  "five": [
    "猪",
    "龙",
    "猴",
    "狗",
    "马"
  ],
  "four": [
    "猪",
    "龙",
    "猴",
    "狗"
  ],
  "three": [
    "猪",
    "龙",
    "猴"
  ],
  "pools": {
    "3": [
      "猪",
      "龙",
      "猴"
    ],
    "4": [
      "猪",
      "龙",
      "猴",
      "狗"
    ],
    "5": [
      "猪",
      "龙",
      "猴",
      "狗",
      "马"
    ]
  },
  "optTails": [
    3,
    5,
    7,
    8,
    0,
    2,
    4
  ],
  "numbers": [
    32,
    3,
    35,
    39,
    8,
    11,
    44,
    15,
    47,
    20,
    23,
    27,
    33,
    13,
    6,
    42
  ],
  "killZodiacs": []
};