var ensembleData = {
  "time": "2026-08-31 21:32:32",
  "issue": "2026243",
  "code": "42,17,12,46,09,24,21",
  "zodiac": "牛,虎,羊,鸡,狗,羊,狗",
  "wave": "blue,green,red,red,blue,red,green",
  "teSx": "狗",
  "teWei": 1,
  "nextIssue": "2026244",
  "ninePool": [
    "兔",
    "鼠",
    "马",
    "蛇",
    "牛",
    "羊",
    "虎",
    "鸡",
    "龙"
  ],
  "sixPool": [
    "兔",
    "鼠",
    "马",
    "蛇",
    "牛",
    "羊"
  ],
  "five": [
    "牛",
    "鼠",
    "蛇",
    "兔",
    "马"
  ],
  "four": [
    "牛",
    "鼠",
    "蛇",
    "兔"
  ],
  "three": [
    "牛",
    "鼠",
    "蛇"
  ],
  "pools": {
    "3": [
      "牛",
      "鼠",
      "蛇"
    ],
    "4": [
      "牛",
      "鼠",
      "蛇",
      "兔"
    ],
    "5": [
      "牛",
      "鼠",
      "蛇",
      "兔",
      "马"
    ]
  },
  "optTails": [
    6,
    8,
    2,
    0,
    7,
    9,
    1
  ],
  "numbers": [
    2,
    6,
    7,
    38,
    42,
    43,
    14,
    18,
    19,
    26,
    30,
    31,
    28,
    24,
    36,
    25
  ],
  "killZodiacs": []
};