var ensembleData = {
  "time": "2026-10-16 21:32:32",
  "issue": "2026289",
  "code": "12,29,19,28,47,34,38",
  "zodiac": "羊,虎,鼠,兔,猴,鸡,蛇",
  "wave": "red,red,red,green,blue,red,green",
  "teSx": "蛇",
  "teWei": 8,
  "nextIssue": "2026290",
  "ninePool": [
    "鸡",
    "兔",
    "狗",
    "虎",
    "猴",
    "牛",
    "鼠",
    "羊",
    "龙"
  ],
  "sixPool": [
    "鸡",
    "兔",
    "狗",
    "虎",
    "猴",
    "牛"
  ],
  "five": [
    "鸡",
    "猴",
    "狗",
    "虎",
    "兔"
  ],
  "four": [
    "鸡",
    "猴",
    "狗",
    "虎"
  ],
  "three": [
    "鸡",
    "猴",
    "狗"
  ],
  "pools": {
    "3": [
      "鸡",
      "猴",
      "狗"
    ],
    "4": [
      "鸡",
      "猴",
      "狗",
      "虎"
    ],
    "5": [
      "鸡",
      "猴",
      "狗",
      "虎",
      "兔"
    ]
  },
  "optTails": [
    1,
    3,
    5,
    0,
    2,
    4,
    6
  ],
  "numbers": [
    33,
    34,
    35,
    9,
    10,
    11,
    45,
    46,
    47,
    21,
    22,
    23,
    41,
    6,
    4,
    16
  ],
  "killZodiacs": []
};