var ensembleData = {
  "time": "2026-10-19 21:32:32",
  "issue": "2026292",
  "code": "39,10,18,23,16,04,36",
  "zodiac": "龙,鸡,牛,猴,兔,兔,羊",
  "wave": "green,blue,red,red,green,blue,blue",
  "teSx": "羊",
  "teWei": 6,
  "nextIssue": "2026293",
  "ninePool": [
    "鼠",
    "龙",
    "牛",
    "猪",
    "蛇",
    "鸡",
    "猴",
    "兔",
    "狗"
  ],
  "sixPool": [
    "鼠",
    "龙",
    "牛",
    "猪",
    "蛇",
    "鸡"
  ],
  "five": [
    "鼠",
    "龙",
    "牛",
    "猪",
    "蛇"
  ],
  "four": [
    "鼠",
    "龙",
    "牛",
    "猪"
  ],
  "three": [
    "鼠",
    "龙",
    "牛"
  ],
  "pools": {
    "3": [
      "鼠",
      "龙",
      "牛"
    ],
    "4": [
      "鼠",
      "龙",
      "牛",
      "猪"
    ],
    "5": [
      "鼠",
      "龙",
      "牛",
      "猪",
      "蛇"
    ]
  },
  "optTails": [
    7,
    9,
    3,
    1,
    5,
    6,
    8
  ],
  "numbers": [
    3,
    6,
    7,
    39,
    42,
    43,
    15,
    18,
    19,
    27,
    30,
    31,
    34,
    26,
    44,
    46
  ],
  "killZodiacs": []
};