var ensembleData = {
  "time": "2026-08-13 21:32:32",
  "issue": "2026225",
  "code": "07,34,27,10,19,38,01",
  "zodiac": "鼠,鸡,龙,鸡,鼠,蛇,马",
  "wave": "red,red,green,blue,red,green,red",
  "teSx": "马",
  "teWei": 1,
  "nextIssue": "2026226",
  "ninePool": [
    "龙",
    "牛",
    "鼠",
    "兔",
    "鸡",
    "羊",
    "猴",
    "虎",
    "蛇"
  ],
  "sixPool": [
    "牛",
    "龙",
    "鼠",
    "兔",
    "鸡",
    "羊"
  ],
  "five": [
    "龙",
    "鼠",
    "牛",
    "兔",
    "鸡"
  ],
  "four": [
    "龙",
    "鼠",
    "牛",
    "兔"
  ],
  "three": [
    "龙",
    "鼠",
    "牛"
  ],
  "pools": {
    "3": [
      "龙",
      "鼠",
      "牛"
    ],
    "4": [
      "龙",
      "鼠",
      "牛",
      "兔"
    ],
    "5": [
      "龙",
      "鼠",
      "牛",
      "兔",
      "鸡"
    ]
  },
  "optTails": [
    3,
    7,
    9,
    5,
    1,
    6,
    8
  ],
  "numbers": [
    3,
    6,
    7,
    39,
    42,
    43,
    15,
    18,
    19,
    27,
    30,
    31,
    34,
    12,
    22,
    28
  ],
  "killZodiacs": []
};