var ensembleData = {
  "time": "2026-08-28 21:32:32",
  "issue": "2026240",
  "code": "02,34,22,26,28,37,27",
  "zodiac": "蛇,鸡,鸡,蛇,兔,马,龙",
  "wave": "red,red,green,blue,green,blue,green",
  "teSx": "龙",
  "teWei": 7,
  "nextIssue": "2026241",
  "ninePool": [
    "兔",
    "鸡",
    "马",
    "猴",
    "蛇",
    "牛",
    "鼠",
    "狗",
    "龙"
  ],
  "sixPool": [
    "兔",
    "鸡",
    "马",
    "猴",
    "蛇",
    "牛"
  ],
  "five": [
    "兔",
    "鸡",
    "马",
    "猴",
    "蛇"
  ],
  "four": [
    "兔",
    "鸡",
    "马",
    "猴"
  ],
  "three": [
    "兔",
    "鸡",
    "马"
  ],
  "pools": {
    "3": [
      "兔",
      "鸡",
      "马"
    ],
    "4": [
      "兔",
      "鸡",
      "马",
      "猴"
    ],
    "5": [
      "兔",
      "鸡",
      "马",
      "猴",
      "蛇"
    ]
  },
  "optTails": [
    4,
    6,
    0,
    8,
    2,
    1,
    3
  ],
  "numbers": [
    1,
    34,
    4,
    37,
    40,
    10,
    13,
    46,
    16,
    49,
    22,
    25,
    28,
    30,
    18,
    6
  ],
  "killZodiacs": []
};