var ensembleData = {
  "time": "2026-09-03 21:32:32",
  "issue": "2026246",
  "code": "22,24,19,10,20,01,30",
  "zodiac": "鸡,羊,鼠,鸡,猪,马,牛",
  "wave": "green,red,red,blue,blue,red,red",
  "teSx": "牛",
  "teWei": 0,
  "nextIssue": "2026247",
  "ninePool": [
    "虎",
    "马",
    "兔",
    "猪",
    "鼠",
    "蛇",
    "猴",
    "鸡",
    "龙"
  ],
  "sixPool": [
    "马",
    "虎",
    "兔",
    "猪",
    "鼠",
    "蛇"
  ],
  "five": [
    "虎",
    "兔",
    "猪",
    "马",
    "鼠"
  ],
  "four": [
    "虎",
    "兔",
    "猪",
    "马"
  ],
  "three": [
    "虎",
    "兔",
    "猪"
  ],
  "pools": {
    "3": [
      "虎",
      "兔",
      "猪"
    ],
    "4": [
      "虎",
      "兔",
      "猪",
      "马"
    ],
    "5": [
      "虎",
      "兔",
      "猪",
      "马",
      "鼠"
    ]
  },
  "optTails": [
    4,
    8,
    0,
    5,
    7,
    9,
    1
  ],
  "numbers": [
    32,
    4,
    5,
    40,
    41,
    8,
    44,
    16,
    17,
    20,
    28,
    29,
    13,
    2,
    31,
    14
  ],
  "killZodiacs": []
};