var ensembleData = {
  "time": "2026-09-12 21:32:32",
  "issue": "2026255",
  "code": "36,22,06,47,39,11,44",
  "zodiac": "羊,鸡,牛,猴,龙,猴,猪",
  "wave": "blue,green,green,blue,green,green,green",
  "teSx": "猪",
  "teWei": 4,
  "nextIssue": "2026256",
  "ninePool": [
    "鼠",
    "龙",
    "鸡",
    "虎",
    "羊",
    "牛",
    "猴",
    "马",
    "蛇"
  ],
  "sixPool": [
    "鼠",
    "龙",
    "鸡",
    "虎",
    "羊",
    "牛"
  ],
  "five": [
    "龙",
    "鼠",
    "虎",
    "鸡",
    "牛"
  ],
  "four": [
    "龙",
    "鼠",
    "虎",
    "鸡"
  ],
  "three": [
    "龙",
    "鼠",
    "虎"
  ],
  "pools": {
    "3": [
      "龙",
      "鼠",
      "虎"
    ],
    "4": [
      "龙",
      "鼠",
      "虎",
      "鸡"
    ],
    "5": [
      "龙",
      "鼠",
      "虎",
      "鸡",
      "牛"
    ]
  },
  "optTails": [
    7,
    9,
    3,
    5,
    1,
    2,
    0
  ],
  "numbers": [
    3,
    5,
    7,
    39,
    41,
    43,
    15,
    17,
    19,
    27,
    29,
    31,
    36,
    6,
    48,
    46
  ],
  "killZodiacs": []
};