var ensembleData = {
  "time": "2026-07-20 21:32:32",
  "issue": "2026201",
  "code": "46,28,19,38,31,25,32",
  "zodiac": "鸡,兔,鼠,蛇,鼠,马,猪",
  "wave": "red,green,red,green,blue,blue,green",
  "teSx": "猪",
  "teWei": 2,
  "nextIssue": "2026202",
  "ninePool": [
    "猴",
    "虎",
    "兔",
    "鸡",
    "蛇",
    "龙",
    "马",
    "羊",
    "牛"
  ],
  "sixPool": [
    "猴",
    "虎",
    "兔",
    "鸡",
    "蛇",
    "龙"
  ],
  "five": [
    "猴",
    "兔",
    "虎",
    "蛇",
    "龙"
  ],
  "four": [
    "猴",
    "兔",
    "虎",
    "蛇"
  ],
  "three": [
    "猴",
    "兔",
    "虎"
  ],
  "pools": {
    "3": [
      "猴",
      "兔",
      "虎"
    ],
    "4": [
      "猴",
      "兔",
      "虎",
      "蛇"
    ],
    "5": [
      "猴",
      "兔",
      "虎",
      "蛇",
      "龙"
    ]
  },
  "optTails": [
    1,
    5,
    7,
    3,
    4,
    6,
    8
  ],
  "numbers": [
    35,
    4,
    5,
    40,
    41,
    11,
    47,
    16,
    17,
    23,
    28,
    29,
    38,
    34,
    22,
    2
  ],
  "killZodiacs": []
};