var ensembleData = {
  "time": "2026-08-05 21:32:32",
  "issue": "2026217",
  "code": "34,12,11,30,42,07,26",
  "zodiac": "鸡,羊,猴,牛,牛,鼠,蛇",
  "wave": "red,red,green,red,blue,red,blue",
  "teSx": "蛇",
  "teWei": 6,
  "nextIssue": "2026218",
  "ninePool": [
    "鸡",
    "猴",
    "狗",
    "羊",
    "猪",
    "牛",
    "兔",
    "鼠",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "羊",
    "狗",
    "猪",
    "牛"
  ],
  "five": [
    "猪",
    "牛",
    "猴",
    "羊",
    "狗"
  ],
  "four": [
    "猪",
    "牛",
    "猴",
    "羊"
  ],
  "three": [
    "猪",
    "牛",
    "猴"
  ],
  "pools": {
    "3": [
      "猪",
      "牛",
      "猴"
    ],
    "4": [
      "猪",
      "牛",
      "猴",
      "羊"
    ],
    "5": [
      "猪",
      "牛",
      "猴",
      "羊",
      "狗"
    ]
  },
  "optTails": [
    8,
    0,
    2,
    4,
    6,
    1,
    3
  ],
  "numbers": [
    32,
    35,
    6,
    8,
    42,
    11,
    44,
    47,
    18,
    20,
    23,
    30,
    12,
    22,
    33,
    48
  ],
  "killZodiacs": []
};