var ensembleData = {
  "time": "2026-10-04 21:32:32",
  "issue": "2026277",
  "code": "41,23,14,31,13,32,11",
  "zodiac": "虎,猴,蛇,鼠,马,猪,猴",
  "wave": "blue,red,blue,blue,red,green,green",
  "teSx": "猴",
  "teWei": 1,
  "nextIssue": "2026278",
  "ninePool": [
    "猪",
    "羊",
    "龙",
    "虎",
    "牛",
    "鼠",
    "猴",
    "马",
    "兔"
  ],
  "sixPool": [
    "猪",
    "羊",
    "龙",
    "虎",
    "牛",
    "鼠"
  ],
  "five": [
    "羊",
    "虎",
    "龙",
    "猪",
    "牛"
  ],
  "four": [
    "羊",
    "虎",
    "龙",
    "猪"
  ],
  "three": [
    "羊",
    "虎",
    "龙"
  ],
  "pools": {
    "3": [
      "羊",
      "虎",
      "龙"
    ],
    "4": [
      "羊",
      "虎",
      "龙",
      "猪"
    ],
    "5": [
      "羊",
      "虎",
      "龙",
      "猪",
      "牛"
    ]
  },
  "optTails": [
    5,
    7,
    9,
    2,
    4,
    6,
    8
  ],
  "numbers": [
    3,
    36,
    5,
    39,
    41,
    12,
    15,
    48,
    17,
    24,
    27,
    29,
    31,
    6,
    18,
    44
  ],
  "killZodiacs": []
};