var ensembleData = {
  "time": "2026-07-24 21:32:32",
  "issue": "2026205",
  "code": "30,17,39,12,11,28,03",
  "zodiac": "牛,虎,龙,羊,猴,兔,龙",
  "wave": "red,green,green,red,green,green,blue",
  "teSx": "龙",
  "teWei": 3,
  "nextIssue": "2026206",
  "ninePool": [
    "鸡",
    "猴",
    "狗",
    "鼠",
    "兔",
    "马",
    "牛",
    "羊",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "狗",
    "鼠",
    "兔",
    "马"
  ],
  "five": [
    "鸡",
    "鼠",
    "兔",
    "猴",
    "马"
  ],
  "four": [
    "鸡",
    "鼠",
    "兔",
    "猴"
  ],
  "three": [
    "鸡",
    "鼠",
    "兔"
  ],
  "pools": {
    "3": [
      "鸡",
      "鼠",
      "兔"
    ],
    "4": [
      "鸡",
      "鼠",
      "兔",
      "猴"
    ],
    "5": [
      "鸡",
      "鼠",
      "兔",
      "猴",
      "马"
    ]
  },
  "optTails": [
    0,
    4,
    6,
    2,
    7,
    9,
    1
  ],
  "numbers": [
    34,
    4,
    7,
    40,
    10,
    43,
    46,
    16,
    19,
    22,
    28,
    31,
    47,
    11,
    37,
    21
  ],
  "killZodiacs": []
};