var ensembleData = {
  "time": "2026-08-07 21:32:32",
  "issue": "2026219",
  "code": "31,41,07,08,29,22,43",
  "zodiac": "鼠,虎,鼠,猪,虎,鸡,鼠",
  "wave": "blue,blue,red,red,red,green,green",
  "teSx": "鼠",
  "teWei": 3,
  "nextIssue": "2026220",
  "ninePool": [
    "鸡",
    "狗",
    "龙",
    "虎",
    "牛",
    "马",
    "兔",
    "羊",
    "猴"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "龙",
    "虎",
    "牛",
    "马"
  ],
  "five": [
    "鸡",
    "狗",
    "龙",
    "牛",
    "虎"
  ],
  "four": [
    "鸡",
    "狗",
    "龙",
    "牛"
  ],
  "three": [
    "鸡",
    "狗",
    "龙"
  ],
  "pools": {
    "3": [
      "鸡",
      "狗",
      "龙"
    ],
    "4": [
      "鸡",
      "狗",
      "龙",
      "牛"
    ],
    "5": [
      "鸡",
      "狗",
      "龙",
      "牛",
      "虎"
    ]
  },
  "optTails": [
    9,
    3,
    5,
    0,
    2,
    4,
    6
  ],
  "numbers": [
    33,
    34,
    3,
    39,
    9,
    10,
    45,
    46,
    15,
    21,
    22,
    27,
    18,
    41,
    29,
    25
  ],
  "killZodiacs": []
};