var ensembleData = {
  "time": "2026-08-08 21:32:32",
  "issue": "2026220",
  "code": "27,39,04,12,38,25,48",
  "zodiac": "龙,龙,兔,羊,蛇,马,羊",
  "wave": "green,green,blue,red,green,blue,blue",
  "teSx": "羊",
  "teWei": 8,
  "nextIssue": "2026221",
  "ninePool": [
    "猪",
    "兔",
    "蛇",
    "狗",
    "鼠",
    "龙",
    "鸡",
    "猴",
    "牛"
  ],
  "sixPool": [
    "猪",
    "兔",
    "蛇",
    "狗",
    "鼠",
    "龙"
  ],
  "five": [
    "猪",
    "兔",
    "蛇",
    "狗",
    "鼠"
  ],
  "four": [
    "猪",
    "兔",
    "蛇",
    "狗"
  ],
  "three": [
    "猪",
    "兔",
    "蛇"
  ],
  "pools": {
    "3": [
      "猪",
      "兔",
      "蛇"
    ],
    "4": [
      "猪",
      "兔",
      "蛇",
      "狗"
    ],
    "5": [
      "猪",
      "兔",
      "蛇",
      "狗",
      "鼠"
    ]
  },
  "optTails": [
    8,
    4,
    0,
    2,
    6,
    7,
    3
  ],
  "numbers": [
    32,
    2,
    4,
    38,
    8,
    40,
    44,
    14,
    16,
    20,
    26,
    28,
    33,
    45,
    21,
    15
  ],
  "killZodiacs": []
};