var ensembleData = {
  "time": "2026-10-08 21:32:32",
  "issue": "2026281",
  "code": "22,19,21,32,48,38,10",
  "zodiac": "鸡,鼠,狗,猪,羊,蛇,鸡",
  "wave": "green,red,green,green,blue,green,blue",
  "teSx": "鸡",
  "teWei": 0,
  "nextIssue": "2026282",
  "ninePool": [
    "牛",
    "猴",
    "猪",
    "兔",
    "龙",
    "虎",
    "鼠",
    "蛇",
    "羊"
  ],
  "sixPool": [
    "牛",
    "猴",
    "猪",
    "兔",
    "龙",
    "虎"
  ],
  "five": [
    "牛",
    "猴",
    "龙",
    "猪",
    "兔"
  ],
  "four": [
    "牛",
    "猴",
    "龙",
    "猪"
  ],
  "three": [
    "牛",
    "猴",
    "龙"
  ],
  "pools": {
    "3": [
      "牛",
      "猴",
      "龙"
    ],
    "4": [
      "牛",
      "猴",
      "龙",
      "猪"
    ],
    "5": [
      "牛",
      "猴",
      "龙",
      "猪",
      "兔"
    ]
  },
  "optTails": [
    3,
    5,
    7,
    6,
    8,
    0,
    2
  ],
  "numbers": [
    35,
    3,
    6,
    39,
    42,
    11,
    47,
    15,
    18,
    23,
    27,
    30,
    41,
    29,
    4,
    16
  ],
  "killZodiacs": []
};