var ensembleData = {
  "time": "2026-07-29 21:32:32",
  "issue": "2026210",
  "code": "40,37,15,17,42,48,49",
  "zodiac": "兔,马,龙,虎,牛,羊,马",
  "wave": "red,blue,blue,green,blue,blue,green",
  "teSx": "马",
  "teWei": 9,
  "nextIssue": "2026211",
  "ninePool": [
    "猴",
    "鸡",
    "龙",
    "虎",
    "鼠",
    "羊",
    "蛇",
    "牛",
    "狗"
  ],
  "sixPool": [
    "猴",
    "鸡",
    "龙",
    "虎",
    "鼠",
    "羊"
  ],
  "five": [
    "龙",
    "猴",
    "鸡",
    "虎",
    "鼠"
  ],
  "four": [
    "龙",
    "猴",
    "鸡",
    "虎"
  ],
  "three": [
    "龙",
    "猴",
    "鸡"
  ],
  "pools": {
    "3": [
      "龙",
      "猴",
      "鸡"
    ],
    "4": [
      "龙",
      "猴",
      "鸡",
      "虎"
    ],
    "5": [
      "龙",
      "猴",
      "鸡",
      "虎",
      "鼠"
    ]
  },
  "optTails": [
    3,
    5,
    7,
    9,
    1,
    0,
    2
  ],
  "numbers": [
    34,
    3,
    35,
    39,
    10,
    11,
    46,
    15,
    47,
    22,
    23,
    27,
    17,
    12,
    43,
    41
  ],
  "killZodiacs": []
};