var ensembleData = {
  "time": "2026-10-02 21:32:32",
  "issue": "2026275",
  "code": "42,49,04,47,14,43,17",
  "zodiac": "牛,马,兔,猴,蛇,鼠,虎",
  "wave": "blue,green,blue,blue,blue,green,green",
  "teSx": "虎",
  "teWei": 7,
  "nextIssue": "2026276",
  "ninePool": [
    "狗",
    "羊",
    "龙",
    "猴",
    "马",
    "蛇",
    "鸡",
    "牛",
    "猪"
  ],
  "sixPool": [
    "狗",
    "羊",
    "龙",
    "猴",
    "马",
    "蛇"
  ],
  "five": [
    "羊",
    "龙",
    "蛇",
    "狗",
    "马"
  ],
  "four": [
    "羊",
    "龙",
    "蛇",
    "狗"
  ],
  "three": [
    "羊",
    "龙",
    "蛇"
  ],
  "pools": {
    "3": [
      "羊",
      "龙",
      "蛇"
    ],
    "4": [
      "羊",
      "龙",
      "蛇",
      "狗"
    ],
    "5": [
      "羊",
      "龙",
      "蛇",
      "狗",
      "马"
    ]
  },
  "optTails": [
    2,
    4,
    6,
    8,
    3,
    5,
    7
  ],
  "numbers": [
    2,
    3,
    36,
    38,
    39,
    12,
    14,
    15,
    48,
    24,
    26,
    27,
    13,
    47,
    37,
    11
  ],
  "killZodiacs": []
};