var ensembleData = {
  "time": "2026-07-28 21:32:32",
  "issue": "2026209",
  "code": "44,05,39,14,21,22,08",
  "zodiac": "猪,虎,龙,蛇,狗,鸡,猪",
  "wave": "green,green,green,blue,green,green,red",
  "teSx": "猪",
  "teWei": 8,
  "nextIssue": "2026210",
  "ninePool": [
    "鸡",
    "蛇",
    "牛",
    "狗",
    "兔",
    "虎",
    "马",
    "猴",
    "羊"
  ],
  "sixPool": [
    "鸡",
    "蛇",
    "牛",
    "狗",
    "兔",
    "虎"
  ],
  "five": [
    "鸡",
    "牛",
    "狗",
    "蛇",
    "兔"
  ],
  "four": [
    "鸡",
    "牛",
    "狗",
    "蛇"
  ],
  "three": [
    "鸡",
    "牛",
    "狗"
  ],
  "pools": {
    "3": [
      "鸡",
      "牛",
      "狗"
    ],
    "4": [
      "鸡",
      "牛",
      "狗",
      "蛇"
    ],
    "5": [
      "鸡",
      "牛",
      "狗",
      "蛇",
      "兔"
    ]
  },
  "optTails": [
    0,
    2,
    6,
    4,
    8,
    9,
    1
  ],
  "numbers": [
    33,
    34,
    6,
    9,
    10,
    42,
    45,
    46,
    18,
    21,
    22,
    30,
    17,
    4,
    14,
    41
  ],
  "killZodiacs": []
};