var ensembleData = {
  "time": "2026-09-20 21:32:32",
  "issue": "2026263",
  "code": "44,28,03,02,24,13,09",
  "zodiac": "猪,兔,龙,蛇,羊,马,狗",
  "wave": "green,green,blue,red,red,red,blue",
  "teSx": "狗",
  "teWei": 9,
  "nextIssue": "2026264",
  "ninePool": [
    "虎",
    "猴",
    "猪",
    "蛇",
    "鸡",
    "狗",
    "牛",
    "鼠",
    "羊"
  ],
  "sixPool": [
    "虎",
    "猴",
    "猪",
    "蛇",
    "鸡",
    "狗"
  ],
  "five": [
    "虎",
    "猪",
    "猴",
    "蛇",
    "鸡"
  ],
  "four": [
    "虎",
    "猪",
    "猴",
    "蛇"
  ],
  "three": [
    "虎",
    "猪",
    "猴"
  ],
  "pools": {
    "3": [
      "虎",
      "猪",
      "猴"
    ],
    "4": [
      "虎",
      "猪",
      "猴",
      "蛇"
    ],
    "5": [
      "虎",
      "猪",
      "猴",
      "蛇",
      "鸡"
    ]
  },
  "optTails": [
    5,
    7,
    1,
    9,
    8,
    0,
    2
  ],
  "numbers": [
    32,
    35,
    5,
    8,
    41,
    11,
    44,
    47,
    17,
    20,
    23,
    29,
    33,
    26,
    38,
    21
  ],
  "killZodiacs": []
};