var ensembleData = {
  "time": "2026-08-19 21:32:32",
  "issue": "2026231",
  "code": "39,46,23,11,08,13,20",
  "zodiac": "龙,鸡,猴,猴,猪,马,猪",
  "wave": "green,red,red,green,red,red,blue",
  "teSx": "猪",
  "teWei": 0,
  "nextIssue": "2026232",
  "ninePool": [
    "鸡",
    "马",
    "龙",
    "蛇",
    "牛",
    "鼠",
    "虎",
    "猴",
    "羊"
  ],
  "sixPool": [
    "鸡",
    "马",
    "龙",
    "蛇",
    "牛",
    "鼠"
  ],
  "five": [
    "马",
    "蛇",
    "鸡",
    "龙",
    "牛"
  ],
  "four": [
    "马",
    "蛇",
    "鸡",
    "龙"
  ],
  "three": [
    "马",
    "蛇",
    "鸡"
  ],
  "pools": {
    "3": [
      "马",
      "蛇",
      "鸡"
    ],
    "4": [
      "马",
      "蛇",
      "鸡",
      "龙"
    ],
    "5": [
      "马",
      "蛇",
      "鸡",
      "龙",
      "牛"
    ]
  },
  "optTails": [
    2,
    4,
    6,
    1,
    3,
    5,
    7
  ],
  "numbers": [
    1,
    2,
    34,
    37,
    38,
    10,
    13,
    14,
    46,
    49,
    22,
    25,
    26,
    30,
    42,
    18
  ],
  "killZodiacs": []
};