var ensembleData = {
  "time": "2026-07-31 21:32:32",
  "issue": "2026212",
  "code": "43,32,16,39,19,27,06",
  "zodiac": "鼠,猪,兔,龙,鼠,龙,牛",
  "wave": "green,green,green,green,red,green,green",
  "teSx": "牛",
  "teWei": 6,
  "nextIssue": "2026213",
  "ninePool": [
    "鼠",
    "蛇",
    "兔",
    "龙",
    "鸡",
    "马",
    "猪",
    "狗",
    "羊"
  ],
  "sixPool": [
    "鼠",
    "蛇",
    "兔",
    "龙",
    "鸡",
    "马"
  ],
  "five": [
    "鼠",
    "兔",
    "蛇",
    "龙",
    "猪"
  ],
  "four": [
    "鼠",
    "兔",
    "蛇",
    "龙"
  ],
  "three": [
    "鼠",
    "兔",
    "蛇"
  ],
  "pools": {
    "3": [
      "鼠",
      "兔",
      "蛇"
    ],
    "4": [
      "鼠",
      "兔",
      "蛇",
      "龙"
    ],
    "5": [
      "鼠",
      "兔",
      "蛇",
      "龙",
      "猪"
    ]
  },
  "optTails": [
    4,
    6,
    8,
    7,
    9,
    1,
    3
  ],
  "numbers": [
    2,
    4,
    38,
    7,
    40,
    43,
    14,
    16,
    19,
    26,
    28,
    31,
    34,
    46,
    13,
    27
  ],
  "killZodiacs": []
};