var ensembleData = {
  "time": "2026-08-23 21:32:32",
  "issue": "2026235",
  "code": "27,26,35,17,44,21,32",
  "zodiac": "龙,蛇,猴,虎,猪,狗,猪",
  "wave": "green,blue,red,green,green,green,green",
  "teSx": "猪",
  "teWei": 2,
  "nextIssue": "2026236",
  "ninePool": [
    "鸡",
    "羊",
    "蛇",
    "猴",
    "马",
    "虎",
    "狗",
    "兔",
    "猪"
  ],
  "sixPool": [
    "鸡",
    "羊",
    "蛇",
    "猴",
    "马",
    "虎"
  ],
  "five": [
    "蛇",
    "鸡",
    "猴",
    "羊",
    "马"
  ],
  "four": [
    "蛇",
    "鸡",
    "猴",
    "羊"
  ],
  "three": [
    "蛇",
    "鸡",
    "猴"
  ],
  "pools": {
    "3": [
      "蛇",
      "鸡",
      "猴"
    ],
    "4": [
      "蛇",
      "鸡",
      "猴",
      "羊"
    ],
    "5": [
      "蛇",
      "鸡",
      "猴",
      "羊",
      "马"
    ]
  },
  "optTails": [
    2,
    4,
    6,
    8,
    0,
    1,
    3
  ],
  "numbers": [
    2,
    34,
    35,
    38,
    10,
    11,
    14,
    46,
    47,
    22,
    23,
    26,
    13,
    41,
    24,
    48
  ],
  "killZodiacs": []
};