var ensembleData = {
  "time": "2026-09-27 21:32:32",
  "issue": "2026270",
  "code": "39,34,20,24,17,06,19",
  "zodiac": "龙,鸡,猪,羊,虎,牛,鼠",
  "wave": "green,red,blue,red,green,green,red",
  "teSx": "鼠",
  "teWei": 9,
  "nextIssue": "2026271",
  "ninePool": [
    "虎",
    "狗",
    "兔",
    "蛇",
    "鸡",
    "猴",
    "羊",
    "牛",
    "龙"
  ],
  "sixPool": [
    "虎",
    "狗",
    "兔",
    "蛇",
    "鸡",
    "猴"
  ],
  "five": [
    "狗",
    "蛇",
    "虎",
    "兔",
    "鸡"
  ],
  "four": [
    "狗",
    "蛇",
    "虎",
    "兔"
  ],
  "three": [
    "狗",
    "蛇",
    "虎"
  ],
  "pools": {
    "3": [
      "狗",
      "蛇",
      "虎"
    ],
    "4": [
      "狗",
      "蛇",
      "虎",
      "兔"
    ],
    "5": [
      "狗",
      "蛇",
      "虎",
      "兔",
      "鸡"
    ]
  },
  "optTails": [
    9,
    1,
    5,
    3,
    2,
    4,
    6
  ],
  "numbers": [
    33,
    2,
    5,
    38,
    9,
    41,
    45,
    14,
    17,
    21,
    26,
    29,
    34,
    4,
    23,
    16
  ],
  "killZodiacs": []
};