var ensembleData = {
  "time": "2026-09-11 21:32:32",
  "issue": "2026254",
  "code": "26,44,35,06,16,10,02",
  "zodiac": "蛇,猪,猴,牛,兔,鸡,蛇",
  "wave": "blue,green,red,green,green,blue,red",
  "teSx": "蛇",
  "teWei": 2,
  "nextIssue": "2026255",
  "ninePool": [
    "马",
    "羊",
    "鸡",
    "鼠",
    "猪",
    "狗",
    "猴",
    "兔",
    "牛"
  ],
  "sixPool": [
    "马",
    "鸡",
    "羊",
    "鼠",
    "猪",
    "狗"
  ],
  "five": [
    "鼠",
    "马",
    "鸡",
    "羊",
    "猪"
  ],
  "four": [
    "鼠",
    "马",
    "鸡",
    "羊"
  ],
  "three": [
    "鼠",
    "马",
    "鸡"
  ],
  "pools": {
    "3": [
      "鼠",
      "马",
      "鸡"
    ],
    "4": [
      "鼠",
      "马",
      "鸡",
      "羊"
    ],
    "5": [
      "鼠",
      "马",
      "鸡",
      "羊",
      "猪"
    ]
  },
  "optTails": [
    7,
    9,
    1,
    3,
    5,
    0,
    2
  ],
  "numbers": [
    1,
    34,
    37,
    7,
    10,
    43,
    13,
    46,
    49,
    19,
    22,
    25,
    31,
    33,
    45,
    44
  ],
  "killZodiacs": []
};