var ensembleData = {
  "time": "2026-07-18 21:32:32",
  "issue": "2026199",
  "code": "17,49,42,45,05,38,36",
  "zodiac": "虎,马,牛,狗,虎,蛇,羊",
  "wave": "green,green,blue,red,green,green,blue",
  "teSx": "羊",
  "teWei": 6,
  "nextIssue": "2026200",
  "ninePool": [
    "鸡",
    "牛",
    "猪",
    "鼠",
    "狗",
    "虎",
    "蛇",
    "兔",
    "猴"
  ],
  "sixPool": [
    "鸡",
    "牛",
    "猪",
    "鼠",
    "狗",
    "虎"
  ],
  "five": [
    "猪",
    "鼠",
    "鸡",
    "牛",
    "狗"
  ],
  "four": [
    "猪",
    "鼠",
    "鸡",
    "牛"
  ],
  "three": [
    "猪",
    "鼠",
    "鸡"
  ],
  "pools": {
    "3": [
      "猪",
      "鼠",
      "鸡"
    ],
    "4": [
      "猪",
      "鼠",
      "鸡",
      "牛"
    ],
    "5": [
      "猪",
      "鼠",
      "鸡",
      "牛",
      "狗"
    ]
  },
  "optTails": [
    0,
    2,
    4,
    8,
    7,
    9,
    1
  ],
  "numbers": [
    32,
    34,
    7,
    8,
    10,
    43,
    44,
    46,
    19,
    20,
    22,
    31,
    17,
    30,
    33,
    42
  ],
  "killZodiacs": []
};