var ensembleData = {
  "time": "2026-08-01 21:32:32",
  "issue": "2026213",
  "code": "09,05,12,22,01,15,35",
  "zodiac": "狗,虎,羊,鸡,马,龙,猴",
  "wave": "blue,green,red,green,red,blue,red",
  "teSx": "猴",
  "teWei": 5,
  "nextIssue": "2026214",
  "ninePool": [
    "狗",
    "羊",
    "鸡",
    "蛇",
    "猪",
    "鼠",
    "牛",
    "猴",
    "兔"
  ],
  "sixPool": [
    "狗",
    "羊",
    "鸡",
    "蛇",
    "猪",
    "鼠"
  ],
  "five": [
    "蛇",
    "羊",
    "狗",
    "鼠",
    "猪"
  ],
  "four": [
    "蛇",
    "羊",
    "狗",
    "鼠"
  ],
  "three": [
    "蛇",
    "羊",
    "狗"
  ],
  "pools": {
    "3": [
      "蛇",
      "羊",
      "狗"
    ],
    "4": [
      "蛇",
      "羊",
      "狗",
      "鼠"
    ],
    "5": [
      "蛇",
      "羊",
      "狗",
      "鼠",
      "猪"
    ]
  },
  "optTails": [
    2,
    4,
    6,
    8,
    9,
    1,
    3
  ],
  "numbers": [
    33,
    2,
    36,
    38,
    9,
    12,
    45,
    14,
    48,
    21,
    24,
    26,
    34,
    46,
    44,
    7
  ],
  "killZodiacs": []
};