var ensembleData = {
  "time": "2026-10-26 21:32:32",
  "issue": "2026299",
  "code": "12,19,28,32,05,42,23",
  "zodiac": "羊,鼠,兔,猪,虎,牛,猴",
  "wave": "red,red,green,green,green,blue,red",
  "teSx": "猴",
  "teWei": 3,
  "nextIssue": "2026300",
  "ninePool": [
    "龙",
    "蛇",
    "马",
    "羊",
    "鸡",
    "狗",
    "鼠",
    "兔",
    "猴"
  ],
  "sixPool": [
    "龙",
    "蛇",
    "马",
    "羊",
    "鸡",
    "狗"
  ],
  "five": [
    "马",
    "龙",
    "蛇",
    "羊",
    "鸡"
  ],
  "four": [
    "马",
    "龙",
    "蛇",
    "羊"
  ],
  "three": [
    "马",
    "龙",
    "蛇"
  ],
  "pools": {
    "3": [
      "马",
      "龙",
      "蛇"
    ],
    "4": [
      "马",
      "龙",
      "蛇",
      "羊"
    ],
    "5": [
      "马",
      "龙",
      "蛇",
      "羊",
      "鸡"
    ]
  },
  "optTails": [
    3,
    5,
    7,
    9,
    1,
    2,
    4
  ],
  "numbers": [
    1,
    2,
    3,
    37,
    38,
    39,
    13,
    14,
    15,
    49,
    25,
    26,
    27,
    34,
    46,
    9
  ],
  "killZodiacs": []
};