var ensembleData = {
  "time": "2026-09-18 21:32:32",
  "issue": "2026261",
  "code": "06,25,43,46,29,47,24",
  "zodiac": "牛,马,鼠,鸡,虎,猴,羊",
  "wave": "green,blue,green,red,red,blue,red",
  "teSx": "羊",
  "teWei": 4,
  "nextIssue": "2026262",
  "ninePool": [
    "虎",
    "兔",
    "猴",
    "鸡",
    "狗",
    "鼠",
    "牛",
    "龙",
    "羊"
  ],
  "sixPool": [
    "虎",
    "兔",
    "猴",
    "鸡",
    "狗",
    "鼠"
  ],
  "five": [
    "虎",
    "兔",
    "猴",
    "狗",
    "鸡"
  ],
  "four": [
    "虎",
    "兔",
    "猴",
    "狗"
  ],
  "three": [
    "虎",
    "兔",
    "猴"
  ],
  "pools": {
    "3": [
      "虎",
      "兔",
      "猴"
    ],
    "4": [
      "虎",
      "兔",
      "猴",
      "狗"
    ],
    "5": [
      "虎",
      "兔",
      "猴",
      "狗",
      "鸡"
    ]
  },
  "optTails": [
    5,
    7,
    1,
    9,
    4,
    6,
    8
  ],
  "numbers": [
    35,
    4,
    5,
    40,
    41,
    11,
    47,
    16,
    17,
    23,
    28,
    29,
    33,
    10,
    31,
    43
  ],
  "killZodiacs": []
};