var ensembleData = {
  "time": "2026-09-15 21:32:32",
  "issue": "2026258",
  "code": "03,23,21,35,05,19,46",
  "zodiac": "龙,猴,狗,猴,虎,鼠,鸡",
  "wave": "blue,red,green,red,green,red,red",
  "teSx": "鸡",
  "teWei": 6,
  "nextIssue": "2026259",
  "ninePool": [
    "虎",
    "蛇",
    "狗",
    "牛",
    "猴",
    "羊",
    "猪",
    "龙",
    "兔"
  ],
  "sixPool": [
    "虎",
    "蛇",
    "狗",
    "牛",
    "猴",
    "羊"
  ],
  "five": [
    "虎",
    "蛇",
    "狗",
    "牛",
    "猴"
  ],
  "four": [
    "虎",
    "蛇",
    "狗",
    "牛"
  ],
  "three": [
    "虎",
    "蛇",
    "狗"
  ],
  "pools": {
    "3": [
      "虎",
      "蛇",
      "狗"
    ],
    "4": [
      "虎",
      "蛇",
      "狗",
      "牛"
    ],
    "5": [
      "虎",
      "蛇",
      "狗",
      "牛",
      "猴"
    ]
  },
  "optTails": [
    5,
    9,
    1,
    7,
    2,
    4,
    6
  ],
  "numbers": [
    33,
    2,
    5,
    38,
    41,
    9,
    45,
    14,
    17,
    21,
    26,
    29,
    35,
    48,
    11,
    18
  ],
  "killZodiacs": []
};