var ensembleData = {
  "time": "2026-08-21 21:32:32",
  "issue": "2026233",
  "code": "18,41,05,49,04,34,07",
  "zodiac": "牛,虎,虎,马,兔,鸡,鼠",
  "wave": "red,blue,green,green,blue,red,red",
  "teSx": "鼠",
  "teWei": 7,
  "nextIssue": "2026234",
  "ninePool": [
    "羊",
    "马",
    "鸡",
    "狗",
    "猴",
    "蛇",
    "虎",
    "牛",
    "龙"
  ],
  "sixPool": [
    "羊",
    "马",
    "鸡",
    "狗",
    "蛇",
    "猴"
  ],
  "five": [
    "马",
    "羊",
    "鸡",
    "蛇",
    "狗"
  ],
  "four": [
    "马",
    "羊",
    "鸡",
    "蛇"
  ],
  "three": [
    "马",
    "羊",
    "鸡"
  ],
  "pools": {
    "3": [
      "马",
      "羊",
      "鸡"
    ],
    "4": [
      "马",
      "羊",
      "鸡",
      "蛇"
    ],
    "5": [
      "马",
      "羊",
      "鸡",
      "蛇",
      "狗"
    ]
  },
  "optTails": [
    2,
    4,
    6,
    1,
    3,
    5,
    7
  ],
  "numbers": [
    1,
    34,
    36,
    37,
    10,
    12,
    13,
    46,
    48,
    49,
    22,
    24,
    25,
    11,
    45,
    21
  ],
  "killZodiacs": []
};