var ensembleData = {
  "time": "2026-09-04 21:32:32",
  "issue": "2026247",
  "code": "03,09,43,29,46,04,40",
  "zodiac": "龙,狗,鼠,虎,鸡,兔,兔",
  "wave": "blue,blue,green,red,red,blue,red",
  "teSx": "兔",
  "teWei": 0,
  "nextIssue": "2026248",
  "ninePool": [
    "猪",
    "蛇",
    "鼠",
    "牛",
    "羊",
    "马",
    "狗",
    "龙",
    "虎"
  ],
  "sixPool": [
    "猪",
    "蛇",
    "鼠",
    "牛",
    "羊",
    "马"
  ],
  "five": [
    "猪",
    "鼠",
    "牛",
    "蛇",
    "羊"
  ],
  "four": [
    "猪",
    "鼠",
    "牛",
    "蛇"
  ],
  "three": [
    "猪",
    "鼠",
    "牛"
  ],
  "pools": {
    "3": [
      "猪",
      "鼠",
      "牛"
    ],
    "4": [
      "猪",
      "鼠",
      "牛",
      "蛇"
    ],
    "5": [
      "猪",
      "鼠",
      "牛",
      "蛇",
      "羊"
    ]
  },
  "optTails": [
    8,
    0,
    2,
    4,
    7,
    9,
    1
  ],
  "numbers": [
    32,
    6,
    7,
    8,
    42,
    43,
    44,
    18,
    19,
    20,
    30,
    31,
    13,
    2,
    36,
    25
  ],
  "killZodiacs": []
};