var ensembleData = {
  "time": "2026-07-21 21:32:32",
  "issue": "2026202",
  "code": "21,15,25,47,13,45,40",
  "zodiac": "狗,龙,马,猴,马,狗,兔",
  "wave": "green,blue,blue,blue,red,red,red",
  "teSx": "兔",
  "teWei": 0,
  "nextIssue": "2026203",
  "ninePool": [
    "鸡",
    "牛",
    "羊",
    "狗",
    "猴",
    "鼠",
    "猪",
    "龙",
    "蛇"
  ],
  "sixPool": [
    "鸡",
    "牛",
    "羊",
    "狗",
    "鼠",
    "猴"
  ],
  "five": [
    "牛",
    "羊",
    "鸡",
    "鼠",
    "猴"
  ],
  "four": [
    "牛",
    "羊",
    "鸡",
    "鼠"
  ],
  "three": [
    "牛",
    "羊",
    "鸡"
  ],
  "pools": {
    "3": [
      "牛",
      "羊",
      "鸡"
    ],
    "4": [
      "牛",
      "羊",
      "鸡",
      "鼠"
    ],
    "5": [
      "牛",
      "羊",
      "鸡",
      "鼠",
      "猴"
    ]
  },
  "optTails": [
    6,
    2,
    8,
    0,
    4,
    7,
    9
  ],
  "numbers": [
    34,
    36,
    6,
    42,
    10,
    12,
    46,
    48,
    18,
    22,
    24,
    30,
    35,
    11,
    33,
    43
  ],
  "killZodiacs": []
};