var ensembleData = {
  "time": "2026-09-28 21:32:32",
  "issue": "2026271",
  "code": "25,02,05,22,20,31,35",
  "zodiac": "马,蛇,虎,鸡,猪,鼠,猴",
  "wave": "blue,red,green,green,blue,blue,red",
  "teSx": "猴",
  "teWei": 5,
  "nextIssue": "2026272",
  "ninePool": [
    "龙",
    "虎",
    "马",
    "狗",
    "牛",
    "羊",
    "兔",
    "猪",
    "蛇"
  ],
  "sixPool": [
    "龙",
    "虎",
    "马",
    "狗",
    "牛",
    "羊"
  ],
  "five": [
    "狗",
    "牛",
    "马",
    "虎",
    "龙"
  ],
  "four": [
    "狗",
    "牛",
    "马",
    "虎"
  ],
  "three": [
    "狗",
    "牛",
    "马"
  ],
  "pools": {
    "3": [
      "狗",
      "牛",
      "马"
    ],
    "4": [
      "狗",
      "牛",
      "马",
      "虎"
    ],
    "5": [
      "狗",
      "牛",
      "马",
      "虎",
      "龙"
    ]
  },
  "optTails": [
    9,
    1,
    3,
    5,
    6,
    8,
    0
  ],
  "numbers": [
    33,
    1,
    37,
    6,
    9,
    42,
    45,
    13,
    49,
    18,
    21,
    25,
    30,
    41,
    36,
    3
  ],
  "killZodiacs": []
};