var ensembleData = {
  "time": "2026-08-10 21:32:32",
  "issue": "2026222",
  "code": "49,14,47,27,18,38,26",
  "zodiac": "马,蛇,猴,龙,牛,蛇,蛇",
  "wave": "green,blue,blue,green,red,green,blue",
  "teSx": "蛇",
  "teWei": 6,
  "nextIssue": "2026223",
  "ninePool": [
    "猪",
    "牛",
    "猴",
    "羊",
    "兔",
    "狗",
    "鼠",
    "鸡",
    "龙"
  ],
  "sixPool": [
    "猪",
    "牛",
    "猴",
    "羊",
    "兔",
    "狗"
  ],
  "five": [
    "猪",
    "牛",
    "猴",
    "兔",
    "羊"
  ],
  "four": [
    "猪",
    "牛",
    "猴",
    "兔"
  ],
  "three": [
    "猪",
    "牛",
    "猴"
  ],
  "pools": {
    "3": [
      "猪",
      "牛",
      "猴"
    ],
    "4": [
      "猪",
      "牛",
      "猴",
      "兔"
    ],
    "5": [
      "猪",
      "牛",
      "猴",
      "兔",
      "羊"
    ]
  },
  "optTails": [
    8,
    0,
    2,
    4,
    6,
    1,
    3
  ],
  "numbers": [
    32,
    35,
    6,
    8,
    42,
    11,
    44,
    47,
    18,
    20,
    23,
    30,
    12,
    33,
    28,
    21
  ],
  "killZodiacs": []
};