var ensembleData = {
  "time": "2026-10-28 21:32:32",
  "issue": "2026301",
  "code": "27,41,23,11,02,43,17",
  "zodiac": "龙,虎,猴,猴,蛇,鼠,虎",
  "wave": "green,blue,red,green,red,green,green",
  "teSx": "虎",
  "teWei": 7,
  "nextIssue": "2026302",
  "ninePool": [
    "狗",
    "鸡",
    "猴",
    "羊",
    "马",
    "蛇",
    "龙",
    "鼠",
    "牛"
  ],
  "sixPool": [
    "狗",
    "鸡",
    "猴",
    "羊",
    "马",
    "蛇"
  ],
  "five": [
    "狗",
    "鸡",
    "猴",
    "羊",
    "蛇"
  ],
  "four": [
    "狗",
    "鸡",
    "猴",
    "羊"
  ],
  "three": [
    "狗",
    "鸡",
    "猴"
  ],
  "pools": {
    "3": [
      "狗",
      "鸡",
      "猴"
    ],
    "4": [
      "狗",
      "鸡",
      "猴",
      "羊"
    ],
    "5": [
      "狗",
      "鸡",
      "猴",
      "羊",
      "蛇"
    ]
  },
  "optTails": [
    1,
    3,
    5,
    9,
    0,
    2,
    4
  ],
  "numbers": [
    33,
    34,
    35,
    9,
    10,
    11,
    45,
    46,
    47,
    21,
    22,
    23,
    37,
    26,
    1,
    49
  ],
  "killZodiacs": []
};