var ensembleData = {
  "time": "2026-09-08 21:32:32",
  "issue": "2026251",
  "code": "09,06,11,25,08,45,30",
  "zodiac": "狗,牛,猴,马,猪,狗,牛",
  "wave": "blue,green,green,blue,red,red,red",
  "teSx": "牛",
  "teWei": 0,
  "nextIssue": "2026252",
  "ninePool": [
    "羊",
    "虎",
    "马",
    "鼠",
    "兔",
    "猴",
    "蛇",
    "鸡",
    "龙"
  ],
  "sixPool": [
    "羊",
    "虎",
    "马",
    "鼠",
    "兔",
    "猴"
  ],
  "five": [
    "虎",
    "鼠",
    "羊",
    "马",
    "兔"
  ],
  "four": [
    "虎",
    "鼠",
    "羊",
    "马"
  ],
  "three": [
    "虎",
    "鼠",
    "羊"
  ],
  "pools": {
    "3": [
      "虎",
      "鼠",
      "羊"
    ],
    "4": [
      "虎",
      "鼠",
      "羊",
      "马"
    ],
    "5": [
      "虎",
      "鼠",
      "羊",
      "马",
      "兔"
    ]
  },
  "optTails": [
    7,
    9,
    1,
    5,
    3,
    2,
    4
  ],
  "numbers": [
    36,
    5,
    7,
    41,
    43,
    12,
    48,
    17,
    19,
    24,
    29,
    31,
    13,
    25,
    47,
    35
  ],
  "killZodiacs": []
};