var ensembleData = {
  "time": "2026-09-05 21:32:32",
  "issue": "2026248",
  "code": "43,26,49,39,14,27,20",
  "zodiac": "鼠,蛇,马,龙,蛇,龙,猪",
  "wave": "green,blue,green,green,blue,green,blue",
  "teSx": "猪",
  "teWei": 0,
  "nextIssue": "2026249",
  "ninePool": [
    "蛇",
    "鼠",
    "羊",
    "马",
    "兔",
    "猴",
    "牛",
    "龙",
    "猪"
  ],
  "sixPool": [
    "蛇",
    "鼠",
    "羊",
    "马",
    "兔",
    "猴"
  ],
  "five": [
    "蛇",
    "鼠",
    "兔",
    "马",
    "猴"
  ],
  "four": [
    "蛇",
    "鼠",
    "兔",
    "马"
  ],
  "three": [
    "蛇",
    "鼠",
    "兔"
  ],
  "pools": {
    "3": [
      "蛇",
      "鼠",
      "兔"
    ],
    "4": [
      "蛇",
      "鼠",
      "兔",
      "马"
    ],
    "5": [
      "蛇",
      "鼠",
      "兔",
      "马",
      "猴"
    ]
  },
  "optTails": [
    4,
    6,
    8,
    2,
    7,
    9,
    1
  ],
  "numbers": [
    2,
    4,
    38,
    7,
    40,
    43,
    14,
    16,
    19,
    26,
    28,
    31,
    13,
    24,
    36,
    47
  ],
  "killZodiacs": []
};