var ensembleData = {
  "time": "2026-10-03 21:32:32",
  "issue": "2026276",
  "code": "02,21,17,40,11,24,14",
  "zodiac": "蛇,狗,虎,兔,猴,羊,蛇",
  "wave": "red,green,green,red,green,red,blue",
  "teSx": "蛇",
  "teWei": 4,
  "nextIssue": "2026277",
  "ninePool": [
    "鸡",
    "龙",
    "兔",
    "牛",
    "猴",
    "猪",
    "马",
    "鼠",
    "羊"
  ],
  "sixPool": [
    "鸡",
    "龙",
    "兔",
    "牛",
    "猴",
    "猪"
  ],
  "five": [
    "兔",
    "鸡",
    "龙",
    "牛",
    "猪"
  ],
  "four": [
    "兔",
    "鸡",
    "龙",
    "牛"
  ],
  "three": [
    "兔",
    "鸡",
    "龙"
  ],
  "pools": {
    "3": [
      "兔",
      "鸡",
      "龙"
    ],
    "4": [
      "兔",
      "鸡",
      "龙",
      "牛"
    ],
    "5": [
      "兔",
      "鸡",
      "龙",
      "牛",
      "猪"
    ]
  },
  "optTails": [
    4,
    6,
    0,
    8,
    2,
    3,
    5
  ],
  "numbers": [
    34,
    3,
    4,
    39,
    40,
    10,
    46,
    15,
    16,
    22,
    27,
    28,
    47,
    6,
    11,
    23
  ],
  "killZodiacs": []
};