var ensembleData = {
  "time": "2026-09-07 21:32:32",
  "issue": "2026250",
  "code": "10,06,39,47,37,17,14",
  "zodiac": "鸡,牛,龙,猴,马,虎,蛇",
  "wave": "blue,green,green,blue,blue,green,blue",
  "teSx": "蛇",
  "teWei": 4,
  "nextIssue": "2026251",
  "ninePool": [
    "鼠",
    "兔",
    "鸡",
    "猴",
    "猪",
    "羊",
    "狗",
    "虎",
    "牛"
  ],
  "sixPool": [
    "鼠",
    "兔",
    "鸡",
    "猴",
    "猪",
    "羊"
  ],
  "five": [
    "兔",
    "鸡",
    "猴",
    "鼠",
    "猪"
  ],
  "four": [
    "兔",
    "鸡",
    "猴",
    "鼠"
  ],
  "three": [
    "兔",
    "鸡",
    "猴"
  ],
  "pools": {
    "3": [
      "兔",
      "鸡",
      "猴"
    ],
    "4": [
      "兔",
      "鸡",
      "猴",
      "鼠"
    ],
    "5": [
      "兔",
      "鸡",
      "猴",
      "鼠",
      "猪"
    ]
  },
  "optTails": [
    4,
    6,
    0,
    8,
    2,
    1,
    3
  ],
  "numbers": [
    34,
    35,
    4,
    40,
    10,
    11,
    46,
    47,
    16,
    22,
    23,
    28,
    36,
    31,
    43,
    7
  ],
  "killZodiacs": []
};