var ensembleData = {
  "time": "2026-09-23 21:32:32",
  "issue": "2026266",
  "code": "38,42,37,29,45,18,08",
  "zodiac": "蛇,牛,马,虎,狗,牛,猪",
  "wave": "green,blue,blue,red,red,red,red",
  "teSx": "猪",
  "teWei": 8,
  "nextIssue": "2026267",
  "ninePool": [
    "虎",
    "龙",
    "猴",
    "蛇",
    "牛",
    "羊",
    "兔",
    "狗",
    "马"
  ],
  "sixPool": [
    "虎",
    "龙",
    "猴",
    "蛇",
    "牛",
    "羊"
  ],
  "five": [
    "虎",
    "猴",
    "蛇",
    "龙",
    "牛"
  ],
  "four": [
    "虎",
    "猴",
    "蛇",
    "龙"
  ],
  "three": [
    "虎",
    "猴",
    "蛇"
  ],
  "pools": {
    "3": [
      "虎",
      "猴",
      "蛇"
    ],
    "4": [
      "虎",
      "猴",
      "蛇",
      "龙"
    ],
    "5": [
      "虎",
      "猴",
      "蛇",
      "龙",
      "牛"
    ]
  },
  "optTails": [
    5,
    7,
    1,
    9,
    3,
    2,
    4
  ],
  "numbers": [
    2,
    35,
    5,
    38,
    41,
    11,
    14,
    47,
    17,
    23,
    26,
    29,
    15,
    36,
    3,
    6
  ],
  "killZodiacs": []
};