var ensembleData = {
  "time": "2026-09-29 21:32:32",
  "issue": "2026272",
  "code": "43,15,04,06,32,36,02",
  "zodiac": "鼠,龙,兔,牛,猪,羊,蛇",
  "wave": "green,blue,blue,green,green,blue,red",
  "teSx": "蛇",
  "teWei": 2,
  "nextIssue": "2026273",
  "ninePool": [
    "羊",
    "龙",
    "牛",
    "马",
    "鸡",
    "猴",
    "猪",
    "虎",
    "兔"
  ],
  "sixPool": [
    "羊",
    "龙",
    "牛",
    "马",
    "鸡",
    "猴"
  ],
  "five": [
    "鸡",
    "羊",
    "牛",
    "马",
    "猴"
  ],
  "four": [
    "鸡",
    "羊",
    "牛",
    "马"
  ],
  "three": [
    "鸡",
    "羊",
    "牛"
  ],
  "pools": {
    "3": [
      "鸡",
      "羊",
      "牛"
    ],
    "4": [
      "鸡",
      "羊",
      "牛",
      "马"
    ],
    "5": [
      "鸡",
      "羊",
      "牛",
      "马",
      "猴"
    ]
  },
  "optTails": [
    2,
    6,
    0,
    4,
    8,
    5,
    9
  ],
  "numbers": [
    34,
    36,
    6,
    10,
    42,
    12,
    46,
    48,
    18,
    22,
    24,
    30,
    13,
    15,
    25,
    3
  ],
  "killZodiacs": []
};