var ensembleData = {
  "time": "2026-10-07 21:32:32",
  "issue": "2026280",
  "code": "01,26,28,29,03,05,15",
  "zodiac": "马,蛇,兔,虎,龙,虎,龙",
  "wave": "red,blue,green,red,blue,green,blue",
  "teSx": "龙",
  "teWei": 5,
  "nextIssue": "2026281",
  "ninePool": [
    "鸡",
    "羊",
    "猴",
    "兔",
    "鼠",
    "猪",
    "牛",
    "狗",
    "马"
  ],
  "sixPool": [
    "鸡",
    "羊",
    "猴",
    "兔",
    "鼠",
    "猪"
  ],
  "five": [
    "鸡",
    "羊",
    "兔",
    "猴",
    "猪"
  ],
  "four": [
    "鸡",
    "羊",
    "兔",
    "猴"
  ],
  "three": [
    "鸡",
    "羊",
    "兔"
  ],
  "pools": {
    "3": [
      "鸡",
      "羊",
      "兔"
    ],
    "4": [
      "鸡",
      "羊",
      "兔",
      "猴"
    ],
    "5": [
      "鸡",
      "羊",
      "兔",
      "猴",
      "猪"
    ]
  },
  "optTails": [
    4,
    6,
    0,
    2,
    8,
    1,
    5
  ],
  "numbers": [
    34,
    36,
    4,
    40,
    10,
    12,
    46,
    48,
    16,
    22,
    24,
    28,
    31,
    43,
    23,
    44
  ],
  "killZodiacs": []
};