var ensembleData = {
  "time": "2026-08-20 21:32:32",
  "issue": "2026232",
  "code": "29,10,17,04,46,20,42",
  "zodiac": "虎,鸡,虎,兔,鸡,猪,牛",
  "wave": "red,blue,green,blue,red,blue,blue",
  "teSx": "牛",
  "teWei": 2,
  "nextIssue": "2026233",
  "ninePool": [
    "鼠",
    "龙",
    "鸡",
    "马",
    "狗",
    "猪",
    "猴",
    "虎",
    "蛇"
  ],
  "sixPool": [
    "鼠",
    "龙",
    "鸡",
    "马",
    "狗",
    "猪"
  ],
  "five": [
    "狗",
    "龙",
    "鸡",
    "鼠",
    "马"
  ],
  "four": [
    "狗",
    "龙",
    "鸡",
    "鼠"
  ],
  "three": [
    "狗",
    "龙",
    "鸡"
  ],
  "pools": {
    "3": [
      "狗",
      "龙",
      "鸡"
    ],
    "4": [
      "狗",
      "龙",
      "鸡",
      "鼠"
    ],
    "5": [
      "狗",
      "龙",
      "鸡",
      "鼠",
      "马"
    ]
  },
  "optTails": [
    9,
    3,
    5,
    1,
    7,
    0,
    2
  ],
  "numbers": [
    33,
    34,
    3,
    39,
    9,
    10,
    45,
    46,
    15,
    21,
    22,
    27,
    44,
    32,
    8,
    20
  ],
  "killZodiacs": []
};